{"title": "Struggling to Find English-Speaking Part-Time Jobs in Germany: Seeking Advice and Recommendations", "selftext": "I've found that searching for a part-time job here is a nightmare. Most descriptions are either partially in English with the most crucial information in German, or they’re entirely in German but the job title is in English. They often mention that learners of German are welcome to apply, but if you didn’t translate the job post, you wouldn’t even know you could still apply.\n\nWhat’s frustrating is that the only part often written in English is the discrimination clause at the end. It feels counterproductive if half, if not all, of your job description is in German.\n\nI’m aware that Germany has immigration policies that make integration challenging, and I’m also familiar with its past—the Nazism, the human zoos of the 1800s-1900s, and other dark chapters.\n\nBut my question is: if there’s so much concern about people coming to the country and relying on government benefits, why make it so hard for them to find work in the first place? Especially for students who genuinely want to work to support their studies and get ahead in life.\n\nSince I'm struggling to find anything, I would love to hear your thoughts. If you have any recommendations for websites offering real English-speaking jobs or anything where beginner-level German is accepted, please let me know.\n\nAll the best.\n\nEdit: I’m in the process of learning German and I’m conscious that it isn’t gonna happen overnight. In the mean time, I’m still looking for work. So those who think I’m just waiting for it to fall in my lap I’m sorry to disappoint. Atp what’s the point in ppl answering if it’s to just tell me to learn German?\n\n I am, do you want to help me learn? Will you pay for it? If not keep it moving!", "author": "Kpoper_mimi234", "created_utc": 1724929484.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/1f3zli1/struggling_to_find_englishspeaking_parttime_jobs/", "num_comments": 24, "subreddit": "berlin", "id": "1f3zli1", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Part-time Salary as a Student: Munich vs. Berlin", "selftext": "Hey fellow Redditors!\n\nI'm a student currently living in Germany and considering taking up a part-time job to support my finances. I have been researching the average part-time salaries for students in Munich and Berlin, but I'd love to hear your insights and experiences.\n\nCould anyone shed some light on what I can expect to earn as a part-time student worker in these two cities? Any range or average figures would be greatly appreciated!\n\nKnowing this information will greatly help me plan my budget and calculate how much I can allocate towards my expenses. Additionally, if you have any tips or advice regarding finding part-time jobs or managing finances as a student in either Munich or Berlin, please feel free to share!\n\nLooking forward to hearing your thoughts and experiences. Thanks in advance for your help!  \nr/berlin r/Munich r/germany", "author": "aggarwalya", "created_utc": 1684899599.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/13qa02l/parttime_salary_as_a_student_munich_vs_berlin/", "num_comments": 19, "subreddit": "berlin", "id": "13qa02l", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "International Student coming to Berlin", "selftext": "Hi All,\n\nI am excited to start my new journey in Berlin. I will be coming to Berlin for pursuing my Masters in Arden University Berlin Campus and would like to know the bouts of berlin such as cheap accommodation and part time jobs for international students. My course will be in English and i don't know the German language but I am keen to learn once i get there!", "author": "Moscow_Chikna", "created_utc": 1677489621.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/11d7j3k/international_student_coming_to_berlin/", "num_comments": 2, "subreddit": "berlin", "id": "11d7j3k", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "What part-time jobs can I find as a Turkish Student planning to study in Berlin?", "selftext": "I am learning German and I'm aiming to be fluent at it. But since I'll possibly move this summer, I'm not sure if I'd be proficient enough to get a minimum-wage job there by then, so until I am proficient enough, I'd like to have a job where to make ends meet so I can have a bit of spare money to pay for my rent. I am already a freelance music producer and musician but I only make like 100 euros a month at most right now. I will possibly be studying Music Production in Berlin.", "author": "dinoisgrooovin", "created_utc": 1641388455.0, "score": 2, "url": "https://www.reddit.com/r/berlin/comments/rwmnjc/what_parttime_jobs_can_i_find_as_a_turkish/", "num_comments": 9, "subreddit": "berlin", "id": "rwmnjc", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "I thought things would be different in Berlin", "selftext": "Hi guys,\n\nI'm an International student from Istanbul. Last year, I got accepted to a master's program at Goethe University Frankfurt and rejected by Fu Berlin due to my GPA. Surprisingly, I was able to transfer to Fu Berlin last semester. I wanted to move to Berlin because I was afraid of the life expenses in Frankfurt (and English speaking job opportunities). Before I came to Germany, I mostly read stuff that implied Frankfurt is not really a cheap city, and so many people said the opposite for Berlin. My main concern was finding an affordable accommodation in general. \n\nIn Frankfurt (including Offenbach), I was able to find a room for 280-400 price range. But in Berlin, even though I increased my budget to 500 euros, still no luck. I was able to increase my budget thanks to the part time job I found. I know it's not an easy process but I'd expect things would be a bit easier in Berlin. And I don't want to imagine the situation in Munich.", "author": "vitainpixels", "created_utc": 1629248953.0, "score": 11, "url": "https://www.reddit.com/r/berlin/comments/p6gwp4/i_thought_things_would_be_different_in_berlin/", "num_comments": 20, "subreddit": "berlin", "id": "p6gwp4", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Living in Berlin vs Frankfurt (Oder)", "selftext": "I am an incoming student at European University Viadrina, Frankfurt (Oder). I have two options for accomodation:\n\n1. Rent a place in Frankfurt (Oder) close to the university. Commute to Berlin for part-time job and for entertainment\n\n2. Rent a place in Berlin and commute to Frankfurt (Oder) for university classes\n\nI've heard Frankfurt (Oder) doesn't have much going on. Berlin has lots of things to do. However, learning German will be difficult in Berlin as opposed to Frankfurt (Oder). Additionally, I have quite some friends in Berlin, so if I want to meet anyone I'll be the one commuting all the time instead of them (few would want to come to Frankfurt Oder to have a cup of coffee)\nI'm getting an apartment for around 320 EUR in student housing (private 1 bedroom apartment with private bathroom) in Frankfurt (Oder). I'm sure about the prices in Berlin.\n\n1. Which option is better in your opinion, living in Berlin or Frankfurt Oder?\n\n2. I feel the student housing is only open for students who are enrolled at a university. They are cheaper than normal apartments. Will I have to be enrolled in a Berlin based university to live in a student housing in Berlin? Or it doesn't matter where the university is?\n\n3. When I arrive in Germany, I'll have to convert my student visa into a residence permit. Which ausländerbehörde do I need to apply to: the ausländerbehörde based in the city of my residence or the city where the university is based? \nI feel getting the Residence Permit will be faster in Frankfurt (Oder) because its a small city compared to Berlin.", "author": "ssg_partners", "created_utc": 1598501685.0, "score": 1, "url": "https://www.reddit.com/r/berlin/comments/ihechb/living_in_berlin_vs_frankfurt_oder/", "num_comments": 6, "subreddit": "berlin", "id": "ihechb", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Students in Berlin: has COVID affected part-time jobs?", "selftext": "I'm an incoming student for the Winter 2020 batch. I'm wondering if it will be harder than usual to find a student part-time job in Berlin due to the pandemic.", "author": "ssg_partners", "created_utc": 1597808360.0, "score": 3, "url": "https://www.reddit.com/r/berlin/comments/icg9rm/students_in_berlin_has_covid_affected_parttime/", "num_comments": 6, "subreddit": "berlin", "id": "icg9rm", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Any jobs for abroad students?", "selftext": "I am going on a semester abroad next semester\n\nIs there anyway i could have a part time job while studying?\n\nP.S. I dont speak german", "author": "YRAFE", "created_utc": 1562839154.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/cbtw1k/any_jobs_for_abroad_students/", "num_comments": 3, "subreddit": "berlin", "id": "cbtw1k", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "[Ausländerbehörde] Advice on Keplerstraße (18.10.18)", "selftext": "Hey Berliners,\n\nToday I went to the Foreign Registration Office on Keplerstraße to extend my Student Visa, and I wanted to share my experience in hopes of providing some guidance!\n\n**Location**\n\nIt was quite hard to find the place in the dark. After you get out of the U Bahn station, use Google Maps to get to Keplerstraße 2. Enter the alley, with a dentist office to your left. Turn left, and it's the door on the ground level. There is a paper hanging on the door for you to write your name.\n\n**Time**\n\nToday they opened at 10:00. However, they gave out exactly 80 waiting numbers at 6:00. I arrived there at 00:45 and I was third in line. After receiving the waiting number, you have the option to go upstairs to the 3rd floor and wait in the waiting room. If not, you can choose to go home and come back at 9:30. \n\n**The Waiting Crowd**\n\nI think because it's October, there were not so many people. At 6:00, there were about 30 people in total waiting in line. The rest of the waiting numbers were all gone by 8:30. 95% of them were students, thanks to the location being primarily for student residence permit.\n\n**My Experience**\n\nI think I went there a bit too early. If it's not August or September, or beginning of Summer Semester, I would recommend to be there only a few hours in advance. I took plenty of water, snacks, and avoided the cold by sitting inside the U Bahn station. \n\nAfter I received my waiting number, I went upstairs. Even though it was at 6:00, there were two ladies working. They called us by our waiting number, and checked all the documents. They mainly check if you have the documents, and nothing so detailed. Except I did witness a girl being rejected immediately because she tried to change her Type C Visa to Type D Visa by just extending it, without providing any sufficient grounds. So I think they do basic filtering, but this probably will not apply to you if you know you are in the right place for the right thing. \n\nI brought the following documents:   \n\\-Matriculation Letter  \n\\-Proof of Health Insurance  \n\\-Anmeldung  \n\\-Part Time Job contract (just in case)  \n\\-My father's income statement (just in case)  \n\\-My father's proof of employment (just in case)  \n\\-Passport  \n\\-Photo I took the day before\n\nI submitted all the documents to the lady, and she gave me a new waiting number. Then I patiently waited, and at around 9:55, they started to call out the numbers. My number got called, and a lady was already waiting for me with my new residence permit. At 10:30, I was finally out with a 4 year extension on my residence permit!\n\nMy German is not good by all means. However, the lady was quite friendly and talked very slowly. I also tried my best to smile and be polite, even though I was really tired. My residence permit also had expired some days ago, but nobody scolded me for that. I think they understand to a certain degree. \n\nI hope this helps, and good luck!", "author": "Cryptonical_Garden", "created_utc": 1539864482.0, "score": 12, "url": "https://www.reddit.com/r/berlin/comments/9p8nmp/ausländerbehörde_advice_on_keplerstraße_181018/", "num_comments": 14, "subreddit": "berlin", "id": "9p8nmp", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Summer jobs in Berlin", "selftext": "Hello! I'm a modern languages student in the U.K., and I'm searching for a job in Berlin for around two months (August - September) over the summer before I come back to university. I'm expecting to be working in a bar or something, but I don't really know where to start.\n\nDoes anybody know how a native English speaker, who is fluent in German, may be able to get a part time job for two months in the city?\n\nThanks, guys! Any advice would be much appreciated.", "author": "Bywater_", "created_utc": 1498946013.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/6kpptz/summer_jobs_in_berlin/", "num_comments": 4, "subreddit": "berlin", "id": "6kpptz", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Want to move in Berlin in the next year or two. What to know beforehand?", "selftext": "Guten Tag ! As said, I wish to move in Berlin in the summer of 2017 or early 2018. What is there that I should know and need before moving? I went through the FAQ and I'm sure there's a few posts about it so if anyone know of a post submitted before mine about a 'guide' to moving in Berlin, feel free to link it !\n\nTo give a bit of context, I visited Germany 2 years ago and fell in love with the language, climate, people, food, and pretty much everything else. I'm currently a language student in college and chose German as my third language (I speak french and english). I have a part time job in a call center that offer service both in french and english. Im not surr if my level of german after 2 years will be enough for a job like the one i have now (or maybe itll be enough) so i expect to work in retail, groceries or anything else that ill be able to get my hands on. \n\nI expect rent to be high in berlin so i guess theres some districts that are not too high? How much should i have in my bank account before moving? How much should i expect to spend in one year?\n\nThanks a lot to everyone whos willing to chip in :)", "author": "Drunkj3sus", "created_utc": 1456777803.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/48c9kd/want_to_move_in_berlin_in_the_next_year_or_two/", "num_comments": 21, "subreddit": "berlin", "id": "48c9kd", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Data Collectors Needed ASAP (20 hours per week)!", "selftext": "Parknav is a new way to park. Everyone driving in Berlin knows how hard it is to find parking. Imagine a service that would tell you where to go and where street parking is available. This is Parknav: http://parknav.com\n\n\nWe are expanding to Berlin and are looking for part-time data collectors who are reliable and independent. By working with us you will help us make the lives of everyone in the Berlin area nicer, and you will also participate in a transformer company and driving an exciting technology.\n\n\nWe will be doing immediate Skype/Google Hangout video interviews.\n\n\nThe work involves you driving in Berlin for up to 5 hours per day, with frequent stops for refreshing. The hours of work are negotiable, and so are the days. We will expect you to work 4-5 days per week, so this could be a good complement to your income if you're a student or have another part-time job.\n\n\nRequirements:\n\n- Valid Driver License (obtained at least 1 year ago)\n\n- Your own car with insurance (you will be reimbursed for your car use in addition to your pay, see below)\n\n- Reliable\n\n- Independent\n\n- Organized\n\n\nDuration:\n- Approx 1-2 months\n\n\nYou will be given:\n\n- 14 Euros/hr for your work\n+\n- 9 Euros/hr for use of your own car (this includes, but is not limited to, petrol)\n\n(Total is 23 Euros/hr)\n\n- An Android phone and plan for the duration of your contract with us, or we will reimburse you for use of yours.\n\n- Training on how to collect data with us\n\n \nPLEASE CONTACT US AT HR@PARKNAV.COM", "author": "DataCollectionBerlin", "created_utc": 1436901411.0, "score": 4, "url": "https://www.reddit.com/r/berlin/comments/3daeog/data_collectors_needed_asap_20_hours_per_week/", "num_comments": 9, "subreddit": "berlin", "id": "3daeog", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "10 weeks living and working in Berlin - can it be done?", "selftext": "Hey! I've the idea in my head of moving to berlin on my own for about 10 weeks this summer, from the end of June til the start of September. I'm an Irish student, so need to go back to Dublin after it all. I'd like to just get a part time job, explore, meet new people, just generally have a fun time. However, i have no connections in the city, and limited german ( I have the basics but I am a quick learner).After looking at some threads it seems hard to find a job without having german, do you think it would be next to impossible? Also for renting somewhere to stay, ideally I'd like to maybe rent a room somewhere that there are already people living, anyone have any links for where that kind of information would be advertised?\nAny advice on this would be helpful, pretty much planning on starting from scratch!\n\nThanks! :)\nRosalyn", "author": "rosalyn_", "created_utc": 1428156998.0, "score": 0, "url": "https://www.reddit.com/r/berlin/comments/31f5c0/10_weeks_living_and_working_in_berlin_can_it_be/", "num_comments": 5, "subreddit": "berlin", "id": "31f5c0", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "I want to work in Berlin this summer.", "selftext": "Hi, I'm a spanish student and this summer I may go to Berlin to work as a WorkAwayer, where basically they give food and shelter and a job, but you don't receive any salary. I want to work in Berlin to pay my uni year, and because I'm studying Traslation and Interpreting of german and italian, its also a great opportunity to improve my german. The thing is that my actual level in german is really low, but I need to work, also I'm looking for a part time job, and I have previous experience as a waitress. Do you have any reccomendations of what do I need to do to work in Germany? (or what I don't need to do). Thank you so much.", "author": "WolverineOk7891", "created_utc": 1750643475.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1li4mzg/i_want_to_work_in_berlin_this_summer/", "num_comments": 12, "subreddit": "germany", "id": "1li4mzg", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Switching from Student Visa to Residence Card – Do I Need a Blocked Account Again in Berlin?", "selftext": "I’m currently in Germany on a student visa and planning to switch over to a residence permit soon (to continue my studies and part-time job. When I first applied for the student visa, I had to open a blocked account to prove financial means.\n\nMy question is: **I live in Berlin**, **do  I need to show proof of funds again—like another blocked account—or is a regular bank statement sufficient this time?**\n\nHas anyone gone through this process and can share what the Ausländerbehörde asked for? I’d really appreciate any personal experience or official guidance.\n\nThanks in advance!", "author": "1Om6evsN7g", "created_utc": 1750269940.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1leo37a/switching_from_student_visa_to_residence_card_do/", "num_comments": 4, "subreddit": "germany", "id": "1leo37a", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Is studying in Germany as a poor international student viable?", "selftext": "Hi! I'm a student in Egypt who's about to finish 11th grade in a German school. Next year I'll be taking the Abitur, and I want to do good and take the opportunity to study in Germany in order to be able to actually live my life. I want to get my Bachelor's in Computer Science/Informatics.\n\nA few issues though, namely costs. Egypt's a third world country, I don't come from a good background and my family will barely be able to scrape the amount needed for the blocked account. That'll give me €992 per month.\n\nI'm obviously looking to get a part time job or a student job in the country, which should be fine since I speak the language, but I know that will take a long while and I can only work 20 hours a week, earning me about 1100 euros minus tax on top of my blocked account. That should be more than enough, but my blocked account is lasting me a year, and I can't guarantee that I'll even get a job in the first place.\n\nI want to know how viable it is to actually live here. I just want to live my life as a queer person who's been oppressed under a religious conservative regime my whole life. I'm okay with doing whatever it takes to actually live here.\n\nAs part of a school trip, I recently stayed in Berlin for a week, and it was incredible and only motivated me further to come here. I want to ask a few questions:\n\n1. What are the most queer friendly cities in the country? Somewhere where I can simply be respected and tolerated within a community?\n2. How much would it cost to live in said cities? Would my financial position make them viable? (Okay with any living situation; dorms, apartments, WGs.)\n3. If not, where could I live in the country in my financial position (if there's any place?)\n4. Is there anything else I need to be taking into account (aside from semester fees)?\n\nI may edit this post later to add other things I may have forgotten, and I'm always ready to answer questions. Thank you so much for reading and I hope you're able to help!", "author": "OurHobi", "created_utc": 1750081360.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1lct55v/is_studying_in_germany_as_a_poor_international/", "num_comments": 34, "subreddit": "germany", "id": "1lct55v", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Part time in Berlin or Dresden", "selftext": "Hi everyone!\nI’ve recently got an admit from BTU Cottbus-Senftenberg for the upcoming intake. While academics are my priority, I’m also considering part-time job opportunities to support myself during my studies.\n\nSince Cottbus is close to both Dresden and Berlin, I wanted to ask:\nWhich city has better part-time job opportunities for students — Berlin or Dresden?\nAlso, what’s the best way to find a part-time job in those cities (any platforms, tips, or contacts)?", "author": "Spiritual-Tip-8640", "created_utc": 1749479083.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1l765p2/part_time_in_berlin_or_dresden/", "num_comments": 10, "subreddit": "germany", "id": "1l765p2", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Hard to look for English parttime job in Berlin", "selftext": "Hello everyone. I moved to Berlin in late 2023 to do master study in English. My residence card is valid until October 1st, 2025, and I’ve been umemployed here for long months. I’ve been actively searching for a part-time job and working student in English, but unfortunately, I haven’t had any success or luck so far, not even a single interview, despite applying consistently.\n\nMy German is still limited at A1, and I’m currently learning the language. That’s why I’ve only applied to jobs that don’t require German. But as many of you may know, even those roles are highly competitive. Financially, I’m running out of funds. I’m planning to extend my residence card for six more months to complete my studies and continue learning German, but without a source of income, it’s becoming very difficult to sustain myself.\n\nI’m highly motivated and ready to work. I’m urgently looking for any part-time job, including: kitchen help, warehouse work, packaging, delivery, or cleaning, or assistance roles, etc.. I am not picky, just need a chance. This is a humble request to anyone who might know of open part-time positions, and able to refer me somewhere, or offer advice or guidance\n\nI just need a small opportunity to support myself and continue my studies. Thank you so much for reading, any help would mean a lot to me right now. 🙏", "author": "Helpful_Quantity_181", "created_utc": 1749186472.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1l4kbbd/hard_to_look_for_english_parttime_job_in_berlin/", "num_comments": 6, "subreddit": "germany", "id": "1l4kbbd", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Finding a job in Berlin", "selftext": "Hey !! I'm an asian student trying to find a part time job in Berlin . As the situation in Berlin for students is not that good it's literally hard for me to find a job here .. and I need it as I have to deal with my finance all alone .  Can any one suggest me how can I get one or what should I do to have better chances of getting selected. I know german a little bit till A2 . Any student who want share there experience feel free to contact .", "author": "better-risenshine", "created_utc": 1747850029.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1ks4cu3/finding_a_job_in_berlin/", "num_comments": 3, "subreddit": "germany", "id": "1ks4cu3", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Tax-related advice needed: Part-Time and Minijob as Working Student in Berlin", "selftext": "Hi everyone, \n\nI'm here on a non-EU student visa and recently started a part-time working student position at a cafe, which is obviously shift-based. Since the commute is a bit crazy, I've also been looking for other gigs. I interviewed for another position, where they said it would be a minijob until September with the possibility of going part-time after that, depending on performance. This is also shift-based.\n\nMy question then is about taxation. If I understand correctly, the part-time job can be my \"main job\" while the mini-job is more of a \"side hustle,\" but does this affect the taxes the minijob employer pays? If yes, how? And how does it affect the taxes I pay? I did some research but I don't fully understand the different taxation classes :/\n\nDon't know if this is important: I haven't received contracts for either job yet so I can make any changes to make my life re: taxation easier lol", "author": "Constant-Tour6166", "created_utc": 1747320716.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1kna674/taxrelated_advice_needed_parttime_and_minijob_as/", "num_comments": 3, "subreddit": "germany", "id": "1kna674", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Master's Student in Berlin (Process, Energy & Env. Eng. with Robotics Background) Seeking Part-Time Job!", "selftext": "Hallo r/germany! 👋\n\nI'm a Master's student at TU Berlin in Process, Energy and Environmental Engineering, with a Bachelor's in Mechanical Engineering (Robotics & Mechatronics specialisation). I'm currently looking for a part-time job in Berlin to support my studies and gain some valuable experience.\n\nWhile ideally I'd love a part-time role that aligns with my studies (maybe something involving data analysis with Python/MATLAB in an energy-related field, CAD modelling, or even assisting with physical assemblies/fabrication), I'm also very open to opportunities in other fields to gain exposure and, of course, earn some money.\n\nMy German is currently at a professional B1 level – I'm actively learning and improving! I also have a strong command of English and prior experience with two internships in the robotics field (one at a startup).\n\nI'm flexible with the work location within Berlin, though something closer to the university would be ideal. I'm available for approximately 30-40 hours per week.\n\nI've already tried applying through platforms like Flink, Pin Post, and Zenjob, but haven't had much luck so far.\n\n**So, I'm reaching out to this awesome community for suggestions and advice! Do you have any recommendations for:**\n\n* **Specific job platforms or websites that might be good for Master's students, especially those with a technical background and developing German skills?**\n* **Companies or industries in Berlin that are known to hire English-speaking part-time workers, particularly in engineering, tech, or even student assistant roles at universities or research institutions?**\n* **Any tips for tailoring my applications or approaching companies when my German is still improving?**\n* **Are there any specific keywords I should be using in my job search?**\n* **Any other general advice for a Master's student looking for part-time work in Berlin?**\n\nI'm eager to learn and contribute, and any guidance you can offer would be incredibly helpful!\n\nVielen Dank im Voraus! 🙏", "author": "nennenyas_kid", "created_utc": 1745442134.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1k6ab8g/masters_student_in_berlin_process_energy_env_eng/", "num_comments": 4, "subreddit": "germany", "id": "1k6ab8g", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Student Visa with a Fixed-Term Contract", "selftext": "Hi everyone, hope everyone is doing well. I've been living in Berlin since 2021 and am currently struggling with a major problem. I'd really appreciate it if someone could answer my question and share their experience.\n\nI am a non-EU national and have been residing in Berlin since October 2021. I finished my master's in April 2024 and was granted the job-seeker visa which is expiring in October. Unfortunately, I haven't found a full-time job that would allow me to get a work permit, that's why I'm considering doing a second master's degree to stay here.\n\nThe issue is, I can't open another blocked account because I don't have the money. However, I've been working at this irrelevant part time job since January 2024 and have a contract valid until the end of this year. Do you think I can submit my fixed-term contract to Auslaenderbehörde and show a few thousand euros and get the student visa? I have friends who have done the same thing with a permanent student job but my situation is a bit different. Any answer is appreciated, thank you very much for reading my post!", "author": "gokcea23", "created_utc": 1745246145.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1k4f2eo/student_visa_with_a_fixedterm_contract/", "num_comments": 6, "subreddit": "germany", "id": "1k4f2eo", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Master thread: Youth Mobility Visa for Canadians Applying in Germany 2025/2026", "selftext": "When I moved to Hamburg in January 2023 on a 3-month tourist visa (Canadian passport), I applied for the Youth Mobility Program from within Germany —without a job—and quickly discovered how difficult it was to find clear, up-to-date info. Even some immigration officers weren’t familiar with this specific visa, which made the process pretty confusing. So, in true Canadian spirit, over the last two years I’ve compiled everything I learned into one master thread to help future Canadians—and other Working Holiday expats—navigate the process in 2025 and beyond. While this guide will focus primarily on Canadian expats, much of it will apply to others too. Let’s dive in!\n\n**VISA**\n\nThis thread is for the Youth Mobility Visa (YMV) which allows young Canadians to live and work in Germany for up to two years. Though, there’s a catch, which I will get into later: it seems that you **cannot participate in this YMV two consecutive years in a row**? More on this later on. Also, should you apply for this inside Germany, technically you would be applying for a \"residence permit\" and not a \"visa\". Same thing, just specific wording.\n\n**REQUIREMENTS**\n\nFor Canadians, you need to:\n\n* Have a valid passport\n* Be between the ages of 18-35 (if you’re 35 at the time of application, you are eligible even if you turn 36 while in Germany) \n* Have at least €3000 (roughly $4300CAD) in the bank, although I would recommend more, which we’ll get into later.\n\n**COSTS**\n\nThe YMV costs €113 for the first year when you apply for the visa from within Germany. You will make this payment on the day of your visa appointment at the Auslanderbehörde (Immigration Office), using a credit card. Very simple. Now, every time you renew your visa or get a new residence permit card, you will be required to pay a fee that varies from €80 to €113.\n\n**THE 4 DIFFERENT KINDS OF YMV** \n\nSomething important to know from the get-go is that there are actually **4 different categories** of YMVs that can be applied for. Here is a direct copy-paste from the official website of each category:\n\na) Young professionals who wish to obtain further training under a contract of employment and increase their knowledge of Germany’s language, culture and society \n\nb) Young citizens who wish to do a work placement in a business in Germany as part of their studies or training\n\nc) Canadian post-secondary students who wish to engage in an occupational activity during their academic vacation\n\nd) Young citizens who wish to stay in Germany for tourism and cultural discovery purposes while being authorized to work to supplement their financial resources.\n\nIf you're moving to Germany for a year, you'll likely apply for the D-category visa. This working holiday visa allows you to work up to 40 hours a week in any job. However, you can’t apply for the D visa two years in a row. To stay for a second year, you’ll need to apply for the A-CATEGORY visa, which requires an official job contract. It can be any job, like in a café, retail, or an agency, as long as it proves you're employed. My advice? Secure a full-time contract in your first year to make applying for the second year easier.\n\nHere's the tricky part: you can't do two Youth Mobility Visas back-to-back. When I tried to extend my stay, immigration wasn’t clear, but since I had a full-time job, they switched me to a standard 19c 4-year work visa. As for the consecutive year issue, it’s still unclear—you might need to leave Germany for 6 months before reapplying. Don't stress, I’ll explain your options later. Just be sure to ask about second-year options during your first visa meeting—it’ll save you a lot of hassle! More details in step 22 of my integration guide.\n\n**FREELANCING**\n\nPlease note: you CANNOT freelance on this type of visa at all. While there are some workarounds that you could figure out, your best bet would be to work for a specific company on a full-time basis. To freelance legally, you can apply for a separate freelance visa which seems to be a bit more complex and complicated. It is doable, however this thread does not cover anything related to this specific type of visa.\n\n**THINGS TO KNOW BEFORE YOU COMMIT TO MOVING HERE**\n\n**Language:** Germany is a German-speaking country, and when I arrived in Hamburg, I knew no German at all. The excitement of moving abroad fades quickly, and learning the language is key if you plan to stay long-term. Without basic German skills, your job and integration options are limited. I’ve gotten by using the little German I know, but over time, that isn’t enough. You’ll start to feel isolated and foreign, because you are.\n\nIf you're only staying a year or two, you’ll manage, but if you're here to build a life, don’t underestimate the importance of learning the language. It’s exhausting when you can’t join in conversations or understand what's happening around you. So, if you’re serious about staying, take learning German seriously from the start.\n\n**Career:** Career-wise, the key thing to know is that Germans value full-time contracts and people who want to be part of the system. Once you’re in, things become stable and much smoother. The most important point: if you land a full-time job, pay taxes, and make an effort to learn German (even just the basics), you can stay—**no matter your education level**. Canadians are well-respected here, and staying long-term is very achievable.\n\nTo switch from a Youth Mobility Visa to a 4-year 19C work visa (valid for 4 years) after your first year, you don’t need a degree or special qualifications. I only have a high school diploma and work experience. What you do need is:\n\n* A full-time job contract (any industry—restaurant, retail, marketing, engineering, etc.)\n* A registered address (alone or with roommates)\n* An employer willing to fill out a simple form saying they want to keep you. It’s roughly 4 pages and very easy to fill in the blanks. \n\nI wish I had known this from the start—I thought I needed to be a lawyer or doctor to stay in the country. **Not true**. If you work, pay taxes, respect the system, and bring good energy, Germany will happily let you stay. If you’re the type who just wants to work a few part-time jobs, or hang around freelancing… I’m sorry my dear, but this won’t fly easily in a country like Germany.\n\n**Socializing with Germans:** Germans aren’t cold—they’re just direct and don’t put on a show. Their social style can seem blunt, but it’s not meant to be rude. Unlike North Americans, who often feel pressure to be overly polite, Germans skip small talk and just be themselves. They’re not trying to \"sell\" you anything, and that honesty can be tough at first. But honestly, that directness helped me grow. You learn to be more authentic and tougher in the process.\n\n**Garbage and recycling:** You’ve probably heard the rumors, and yes, Germans take garbage and recycling very seriously. That said, it’s actually pretty easy to get used to once you understand the system. That said, something strange happened to me when I first arrived. I once tried to drop off a large bike box at a recycling bin that was completely full. Since it wouldn’t fit through the slot, I left it neatly beside the bin. A month later, I received a €150 fine for improper disposal. Totally ridiculous.\n\nSo here’s my advice—always remove your name and address from anything you recycle. If your info is on it and you don’t dispose of it correctly, they can trace it back to you and issue a fine.\n\n**Sundays:** In Germany, everything’s closed on Sundays—except cafés and restaurants. Malls and grocery stores shut down completely. It’s a throwback at first, but I’ve grown to love the slower pace. Just make sure to do your shopping before 8 PM Saturday, or you're out of luck!\n\n**Cell phone plans:** Oh, the joys of European cell phone plans! Unlike Canada, you can get 500GB of data per month for about €15. I recommend bringing an unlocked phone from Canada and signing up for a month-to-month plan with providers like Smartmobil or Telekom. Avoid long-term contracts, as they can be hard to cancel—many friends have struggled with this. This gives you the flexibility to adjust your plan as needed during your transition.\n\n**Grocery stores and food:** One of my favorite things about living in Europe is the strict food regulations, especially on chemicals and pesticides. The food tastes fresher and healthier than back home, and it’s changed how I view nutrition in Canada. Everything feels less processed, and it’s helped me stay in better shape. While grocery stores are diverse, you might miss some products like big tubs of peanut butter. It takes some adjusting, but overall, I’m much happier with my diet here.\n\nExciting update for 2025: Many stores in Germany are now implementing self-checkout, a concept that was new here in recent years. By the time you arrive, you’ll likely avoid long checkout lines.\n\n**Accommodations for the 1st year:** I don’t recommend starting your Youth Mobility Visa by living alone. Renting your own place in Germany usually requires a full-time job, steady income, and sometimes German skills. It’s tough unless you’ve got money to spare.\n\nInstead, use **WG Gesucht**, Germany’s top site for shared flats. Make a friendly profile with good photos, and pay the €9 for the premium version—it really helps. Living in a WG (shared flat) for 6–12 months gives you time to settle in, meet people, and job hunt without the pressure of a full lease. Sublets are common and worked great for me.\n\nI get it—roommates suck. I had lived alone in Montreal for over four years, so it was a big adjustment. But after a year of sharing a flat with a German woman, I eventually moved into my own studio—and I’m grateful. That transition period gave me the time and space to plan my next step.\n\nNow, speaking of steps…\n\n**Patience in Deutschland:** In Germany, patience is a virtue—seriously. Things move slower here, but in a good way. The North American hustle culture doesn’t really exist. Most Germans do their jobs, then fully disconnect to enjoy life. Things take time, and that’s okay. Personally, my work-life balance has never felt healthier. \n\n**Paperwork:** Please don’t forget—keep track of ***all*** **your documents**. Even small papers can be important, especially for immigration. Get a binder and organize everything in one place. It’s saved me from so many headaches.\n\n**SCHUFA Score:** This is like a credit score and is sometimes required by landlords. You likely won’t need it right away, since you won’t have a German credit history. But if asked, you can apply easily for around €20. Just note: you’ll need a registered address to get one, so it’s something to handle when you’re looking for your own apartment.\n\n**Salary:** In Germany, you are only paid **once per month**, and not biweekly like in Canada. In general, I actually began enjoying this more as it helps to budget your monthly expenses in advance. Truly love it!\n\nReady to apply? This is where the fun begins: an official step by step guide on how to get settled in Germany! Of course, these are the steps that I followed to fully integrate into the country, however some of it may look slightly different to your own. I know, it may seem overwhelming at first, but take it one step at a time and trust the process. More importantly, it’s not difficult—just a matter of staying organized and patient throughout. LET’S GO! \n\n# FULL WALKTHROUGH\n\n*BEFORE ARRIVING IN GERMANY* \n\n**1. Ensure you meet all the requirements for the YMV**\n\nThis is obvious. \n\n**2. Choose your city** \n\nChoosing a city can be tough, but if you love nature, cycling, and a smaller-city-feel without the chaos of London or Paris, I highly recommend Hamburg. To put it in perspective, Hamburg is like the Montreal of Germany, while Berlin feels more like Toronto on crack. Cologne has a mix of Vancouver and Winnipeg vibes, Munich is comparable to Ottawa, and Kiel reminds me of Halifax. Frankfurt, on the other hand, is somewhere between Edmonton, Ottawa, and Toronto.\n\nIf you're considering Berlin, keep in mind that it's massive and gets very hot in the summer. It’s not my vibe, but it might be the perfect fit for you.\n\n**3. Flatshare or single apartment?**\n\nAs I mentioned earlier, a flatshare is the best way to settle in, giving you time to figure things out while integrating into the country. That said, do whatever feels right for you\n\n**4. Find a place** \n\nYou can start looking for housing even before you arrive in Germany using websites like WG Gesucht (better for finding roommates) or Immoscout (more for 1-bedrooms or couples). Create a profile with some nice photos of yourself, and a captivating bio that gives more details about who you are. Now, while Immoscout can be tricky from afar, WG Gesucht makes it easier—you can video call potential flatmates to see if you click. That’s how I did it, and it worked out well. Keep in mind, you’ll need to pay for the premium versions of these sites to get first dibs on the best listings. Most people are paying, so if you don’t, you’ll likely miss out. \n\n**5. Choose date and book flights**\n\nThis is obvious. Also, if I were you, I would recommend that your passport is valid for at least more than 2 years, as it is a bit easier to renew your passport within Canada compared to doing it from afar. Then again, I renewed it from Germany and it wasn’t hard as well, so just something to think about!\n\n**6. Book Anmeldung appointment prior to arriving in Germany**\n\nAn *Anmeldung appointment* is your official address registration in Germany. It proves where you live and is essential for things like receiving mail. Everyone moving to or within Germany must register within 14 days of arrival. Appointments fill up fast, so book early—ideally before you arrive. If you already have a place lined up, try to schedule your appointment within two weeks of landing. Just Google “Anmeldung + \\[city\\]” to find the booking page. Each city’s site is a bit different but usually easy to follow.\n\nAlso, remember: when you leave Germany, you’ll need to *de-register*. It's just part of the usual German bureaucracy. For reference, I booked mine **from Canada** before arriving on Jan 1 and had my appointment on Jan 2—super smooth!\n\n**7. Notify CRA, Healthcard, Authorities of departure**\n\nImportant reminder: Be sure to notify all relevant authorities, including the CRA, your provincial tax office, health card providers, dentists, and any other professionals, that you’re leaving Canada. Communicating this early ensures everyone is aware, which will help avoid unexpected bills and complications when filing taxes later. I didn't do this, and it caused issues down the line.\n\n*ONCE ARRIVED IN GERMANY* \n\n**8. Move into your new flat** \n\nWelcome to Germany! Whether your housing is temporary or long-term, take a moment to celebrate this bold new chapter—you’re about to grow in amazing ways. If you're still on a 3-month tourist visit, make sure to complete steps 9 and 10 quickly to avoid overstaying the 180-day Schengen limit. Look it up if you're unsure about the rules.\n\nA key thing to know: in Germany, your last name *must* be on your mailbox to receive mail. Without it, you won’t get important letters, including legal or job-related documents. Talk to your landlord or subletter to make sure your name is properly displayed—don’t just tape a note, as that may not work. Also, get yourself a black binder to keep all your documents organized. Staying on top of your paperwork will save you a lot of stress down the line.\n\n**9. Get Anmeldung/Tax Number**\n\nWithin 14 days of arriving, you will need to attend an Anmeldung appointment as mentioned above, which registers you and your address into the system of your city. Go to the appointment. Yay! Now, upon registering your new address into the system at the local immigration office, you will receive an official tax number (Steuernummer) sent by mail. Keep this document stored somewhere, as you will need this later once you become employed. This Steuernummer is basically your SIN number in Canada… it’s a number that you will use often in Germany, so take note of this and do not lose it! \n\n**10. Book your official Youth Mobility visa appointment at local Auslanderbehorde** \n\nNow that you’ve received your Anmeldung and tax number, you can immediately book an appointment at the local Ausländerbehörde (immigration office) to apply for your official Youth Mobility Visa. Like the Anmeldung, appointments are made through your city’s official website under “Appointments” → “Visas.” There may not be a specific option for this visa, so selecting “Other” usually works. Available slots are typically 1–2 months out, but don’t worry if it’s 3–4 months away. As long as you have a confirmed appointment, you’re allowed to stay in Germany even if it exceeds your 90-day tourist period. \n\nFor the appointment, bring your passport, Anmeldung, proof of residence (a piece of addressed mail works), passport-sized photos, and any other documents listed in their confirmation email. Be thorough—missing documents can delay the process. Staying organized is key. I had no issues because I was prepared every step of the way.\n\n**11. Find a bank** \n\nWhile my Canadian bank accounts are still active (mostly using my Capital One credit card), I chose to open a German bank account to start living life in euros. The easiest and best option for all expats would be N26 Bank, which has been so easy to use as they have an incredible app. I know, some people have reported that they don’t like it, but I have absolutely loved it. 10/10. I also heard that Revolut was good, but I chose N26 and have no regrets. Most German banks (DKB, Commerzbank, etc) are quite phobic of international folks and require too many steps to open an account. Stick to the ones above. \n\n**12. Getting Insurances** \n\nOne of the first confusing things in Germany is insurance. Everyone—**regardless of job status**—must have health insurance, and it’s paid monthly. Costs range from €200–€700, depending on the provider and coverage.\n\nOnce you have a full-time job, your insurance links to your employer and gets deducted from your paycheck automatically. You won’t even notice it’s gone—it’s just part of the system.\n\nBefore you’re employed, though, you’ll need to pay out of pocket. I used **Feather Insurance** when I first arrived—it’s affordable, easy to cancel, and costs about €75/month. It covered everything I needed until I started work. You can check them out at Feather Insurance.\n\n**13. Savings/Money**\n\nNow, onto finances — you might be wondering how much money you need to get through the first few months before finding a job. There’s no exact number, but I came to Germany with around $10,000 in savings, and even then, the first few months were tough. You’ll need to buy essentials like a bed and household items, and those costs add up quickly.\n\nHow much you’ll need depends on your situation:\n\n* Do you already have a job lined up?\n* Can you find one quickly?\n* Do you have a financial safety net?\n* Do you speak German?\n\nI didn’t speak German or have a degree, but I was motivated and focused on job hunting. It took me about three months to find work. During that time, I paid €600/month for a room in a shared flat and saved where I could. It wasn’t glamorous, but the key was staying focused on getting employed — that should be your top priority in the beginning.\n\n**14. Start job hunting**\n\nFinding a job in Germany can be challenging, especially if you’re not fluent in German. However, being a native English speaker — like I am from Canada — turned out to be a real advantage, particularly in marketing and PR roles. Rather than trying to compete directly with locals, the key is to focus on what makes you different. Your international background, unique perspective, and fresh energy are valuable assets. Use them to your advantage and position yourself as someone who brings something new to the table. In my case, I concentrated my job search within my industry, made use of job fairs, and actively networked on LinkedIn. It took persistence — I applied to 33 jobs, had 2 interviews, and landed 2 jobs within three months of arriving in Hamburg. When people ask, “Do I need to speak German to get a job?” the answer isn’t black and white. Instead of stressing over that, I focused on the value I could offer, which proved to be a much more effective approach than trying to blend in or compete head-to-head with locals.\n\n**15. Keeping track of German documents** \n\nUnlike Canada or Australia, Germany still relies heavily on hard copies. It may seem old-fashioned, but keeping track of all mailed documents—especially from immigration—is crucial. I cannot stress this enough!!! I keep saying it, but that binder will help you to keep everything organized. My smooth integration was largely due to this habit, and I highly recommend doing the same. I brought this binder with me to every appointment, avoiding any type of issues down the line. Thank me later!\n\n**16. Attend your official Youth Mobility Visa appointment**\n\nCongrats—you’re officially allowed to work in Germany! Attending this appointment is a huge step toward integrating into the country. My first appointment? Let’s just say it was... interesting. The immigration officer handling my file had never even heard of the Canadian Youth Mobility Visa. Classic, I told myself. So, he sent me home and told me to come back in two weeks while he read up on it. In the meantime, he handed me a little pink paper called a *Fiktionsbescheinigung*—basically a temporary extension while they process your paperwork. You will likely get one of these at some point, although maybe not.\n\nTwo weeks later, I returned, and boom—everything was finalized! He stamped my passport, and here’s the key thing: the visa’s start date wasn’t when I arrived in Germany but the exact day I got that stamp. So, remember—the one-year YMV clock starts ticking from *that* day!\n\n**17. Secure a job and a full-time contract** \n\nBy now, I hope you’ve had the chance to chat with companies and send out a bunch of applications. Now’s the time to lock in a full-time gig! In Germany, the golden ticket is an *unbefristet* contract—one with no end date. That’s the one you want because it means job security (and no job hunting again anytime soon).\n\nThere’s no magic formula to getting hired, but with persistence—and a little luck—I hope it all falls into place for you!\n\n**18. Choose your insurance provider/Cancel the Feather insurance**\n\nCongratulations on the job! Now it’s time to sort out health insurance. Unlike in Canada, where your employer chooses the provider, in Germany, it’s up to you. You can opt for public or private insurance, but in most cases, public is the way to go. If you go private, you can NEVER switch back to public, so please choose wisely. I recommend TK Insurance—they have an English website and have been very reliable.\n\nOnce you sign up by sending them your employment contract, your insurer will coordinate directly with your employer. The contributions will be deducted automatically from your paycheck, so there’s little for you to do. Just check in with HR, and they’ll guide you through the process. After all of this, you can sign into your Feather account and simply cancel your membership. It was super easy to do for me, and you won’t have any issues. \n\n**19. Personalnummer**\n\nThis is not very important, but just so you know: whenever you join a company and secure your insurance plan, you’ll receive a Personalnummer. As an employee, you’ll receive this number from your employer. This unique code is assigned to each employee and is used to securely store your data within the company’s system. It’s important to note that the same number can’t be assigned to two different employees.\n\nJust to clarify, your personnel number is not an official identification number like your ID card number or social security number. It’s simply a reference used within your employer’s administrative system to organize and access your data more easily. It’s not important, but just don’t confuse it with the other ID numbers.\n\n*ONCE SETTLED IN GERMANY WITH A JOB (Optional but important things to do)*\n\n**20. Doctor/health card** \n\nOnce you’ve signed up for an insurance plan, you’ll receive your health card in the mail. This card is essential for any medical appointments, so always have it with you. Since moving here over two years ago, I haven’t gotten a family doctor, as I’m not someone who visits the doctor often. I’ve only gone to a clinic for STI tests and visited a walk-in for antibiotics, that’s it. As for finding a family doctor, honestly, I don’t have the answer. My advice? Just Google it!\n\n**21. Dentist** \n\nOne thing I found a bit odd when I first moved to Germany is that most insurance plans only cover one dental cleaning per year, and it’s only partially covered. I’m not sure why, but a general cleaning costs around 100 Euros, and after the insurance covers 60, you’ll end up paying about 40 Euros out of pocket. For any major dental work or complex procedures, it’s best to check with your insurance beforehand. On a positive note, my dentist has been great every time I’ve gone.\n\n**22. Home/Accident Insurance**\n\nI know, at this point, you’re probably tired of hearing about insurance, but there’s one more thing I need to mention. Most Germans have personal liability insurance, which covers things like theft, home damage, or even car accidents. For example, if you accidentally crash your bike into someone’s car, this is the insurance that will cover you and ensure you won’t be out XX amounts of euros. I pay just 19 euros a month with **Allianz Direct**, and it’s extra coverage that can save you from unfortunate situations involving someone else’s property or your own. I highly recommend it!\n\n**23. Swapping your Canadian Driver’s License for a German one (after 6 months IF you want)** \n\nOne of the coolest experiences during my transition was getting a German driving license. Not only did it give me more freedom, but it also allowed me to explore the country using car-sharing apps, which have been great. The process was pretty straightforward, and after doing a lot of research, I can confirm: for Canadians and most residents of Westernized countries, **you don’t need an eye exam or extra driving lessons if you already have a full license from your home country.** \n\nThe process was simple—I went on the main website of my city to book an appointment to switch my international driver’s license. Try searching for “Swap international driver's license (city)” on Google and it will come up. I also got a driving record from Canada, but I never actually needed to show it and it was a waste of money. Don't do this as it really was a waste of time unless your city specifically asks for it. \n\nHere’s the catch: when you exchange your international license for a German one, they keep your Canadian card and only return it when you leave the country permanently. No worries though—after the switch, I contacted my license authority in Quebec to report the card as lost, and they mailed me a new one to my Canadian address, which my parents forwarded to me in Germany. Now, I have both cards. It’s also worth mentioning that you’ll need a passport-sized photo for the new card, and I’d recommend bringing your full binder of documents just in case. In Germany, it's always best to be prepared.\n\n**24. Driving in Germany**\n\nSo, you’ve got your driver’s license—now what about a car? Good news: car sharing in Germany is amazing. I highly recommend downloading the **MILES app** (which, unfortunately, you cannot use with a Canadian driver’s license, which is why the switch was necessary). It lets you find nearby cars through the app, and you’re charged about €0.90 per kilometer. For example, a 10 km drive only costs around €10. If you compare that to owning a car, you’ll save a ton—especially if you’re only driving occasionally. Bonus: most of the cars are electric, so no need to ever stop for gas. \n\nAs for driving itself, the rules are pretty similar to Canada. In fact, I’ve found it often feels safer here. Every time I go back to Montreal, I notice how much more intense and fast-paced Canadian drivers are. And yes, there's the Autobahn—Germany’s famous highway with no speed limit. Honestly? It just feels like a regular Canadian highway, except the left lane has a few cars zooming past at lightning speed. You just need to stay alert and keep right unless you're passing. Nothing too wild, definitely doesn’t live up to the hype unless you’re a speed demon.\n\n**25. Renewing your visa for the 2nd year/passport renewal**\n\nAbout three months before your YMV expires, the immigration office will send you a letter reminding you to book a visa renewal appointment. The first thing to do is visit your city’s official immigration website and book an appointment right away to get into the queue. You'll be asked to upload some documents—like your job contract—and that puts you in line for an appointment.\n\nAbout a month later, I got an unexpected email from the immigration office. It said: *“Eligible participants may participate in this program up to two times, but the two stays must not be immediately consecutive. However, I have contacted the Federal Employment Agency in accordance with Section 19c Paragraph 1 of the Residence Act in conjunction with Section 26 Paragraph 1 of the Employment Ordinance.”*\n\nMy heart sank—I had no idea what it meant. Did I have to leave Germany for six months? A few days? Everything was unclear, and I couldn’t get a straight answer. I replied, explaining the confusion, and thankfully they responded to say there was no issue. Because I had a full-time, ongoing contract, the Federal Employment Agency approved a four-year 19C visa instead, which is basically a standard work visa for non-specialists in Germany. This was amazing news as I could stay until 2028. Huge relief! \n\nA few days after that, I got an email with my visa appointment, scheduled for three weeks later. Since I had already submitted my documents online, I just had to show up. At the appointment, they gave me my **Aufenthaltstitel**—your official residence permit, which looks a bit like a Canadian driver's license. You’ll use it as ID, for travel, and as proof of residency, so keep it safe. I carry mine in my wallet daily. They’ll ask you to sign a few documents and pay a fee—about €80. Once that’s done, you're all set. You fucking did it!\n\nOne final tip: While the 19C residence permit is valid for four years, the expiry date on the physical card is tied to your passport expiry date. If your passport expires before those four years are up, you’ll need to get a new passport *and* pay another €80 for a new residence card. My suggestion: make sure your passport is valid for at least four years when you apply for this new permit card. I didn’t know this and had to go through the process again after just one year after getting a new passport.\n\n**26. Quick Language tips** Learning the language is one of the biggest challenges for expats in Germany. As I mentioned above, when I first moved to Hamburg, I knew zero German—no background, no training—which made things pretty difficult and remains my biggest hurdle. That said, the people I’ve met have been incredibly kind and understanding, which eased a lot of the anxiety early on.\n\nWhile I’m no Duolingo superstar, here are a few methods that have really worked for me:\n\n* **Babbel+ (A1 & A2 courses):** Much better than Duolingo, with a clear, structured approach that’s easy to follow. I paid €50 total!\n* **Assimil German (Falsche Beginner):** A fun, workbook-style method from a French company. I use it alongside Babbel.\n* **No language school:** I haven’t taken any formal classes, so I can’t speak to that experience.\n\nGerman won’t just come naturally—you have to be consistent. Even 20 minutes a day can go a long way. Also, unlike Scandinavia, most German cities (aside from Berlin or Frankfurt) aren’t very comfortable with English despite what you’ll read and hear. Yes, people can speak English, but it’s definitely not the preference or the default. You’ll struggle to feel truly comfortable without learning the language.\n\n**27. Side jobs and small freelancing gigs**\n\nWondering if you can earn extra money on the side while working full-time in Germany? Good news! I spoke directly with the immigration office, and according to them, as long as you're fulfilling the duties of your full-time job (the one tied to your visa), the government doesn’t care if you earn a little extra on the side—whether that’s through music, freelancing, or small gigs.\n\nThe biggest takeaway:\n\n* **Your full-time job must remain your primary source of income**\n* **You must pay taxes on all income**\n\nIf your freelance income starts exceeding **€15,000/year**, it could raise flags, so it’s best to speak with your local immigration or tax office if you’re heading in that direction.\n\n**28. Moving into your own solo flat**\n\nOne of my biggest moments of victory was finally moving into my own flat. After a year of shared living, I started searching through[ ](https://www.immobilienscout24.de/)ImmoScout—*the* go-to site for apartments in Germany. You’ll need to pay for the premium version, and honestly, finding a place feels like a full-time job. I was refreshing the page every few minutes and messaging new listings within seconds.\n\nI had all my documents saved and ready to go on my profile. You **have to be intense** about it. If you’re not checking the app constantly, you’ll be competing against 30–50 people who are. As for actually landing a place, it comes down to **luck, being organized, giving off a good vibe at the viewing,** and having your full application ready.\n\nFor my current apartment, I created a really strong application package. It included:\n\n* My SCHUFA score (which is automatically given to you on the Immoscout website when you pay for the premium version, which is why I paid for it)\n* Proof of salary (last 3 months)\n* A screenshot of my Canadian bank account with some savings\n* A short cover page introducing myself and explaining why I really wanted the flat\n\nPresentation matters. Show that you're serious, reliable, and genuinely excited to move in—it makes a difference. A quick tip when apartment hunting in Germany: rent listings will either say **\"€XX warm\"** or **\"€XX kalt.\"**\n\n* **Warm** = all-inclusive (rent + utilities like heating, electricity, etc.)\n* **Kalt** = base rent only — you'll need to **add** utilities on top of that\n\nMake sure you know which one you're looking at so you can budget properly!\n\n**29. Kaution**\n\nCongrats, you’ve scored a flat—amazing! But just like in Canada, there’s a damage deposit to pay. In Germany, it’s called a **Kaution**, and it can be pretty steep—up to three months’ rent in some cases. For example, in my current one-bedroom, the Kaution was €2,500, which is almost $4,000 CAD. On top of that, I had to pay the first month’s rent, so I was out nearly $5,300 CAD just to move in.\n\nIt was a lot, but after working for a year, I had managed to recover. Some deposits are lower, some higher—it all depends on the place and location. Just a heads up: budget well in advance so this doesn’t catch you off guard.\n\n**30. Kleinanzeigan: the Kijiji of Germany**\n\nFormerly known as eBay Kleinanzeigen, Kleinanzeigan is like the German version of Kijiji, where people buy and sell almost everything. I’ve used it to furnish my entire apartment and highly recommend it to anyone moving to Germany. You can find amazing deals, especially in cities like Hamburg and Munich, where wealthy people often sell high-end furniture, electronics, and household items for a fraction of the price. Create an account and start browsing—you’ll find great items before buying new. Quick tip: check the “free” section, as people often give away incredible things. I've scored some amazing finds there!\n\n**31. Rundfunkbeitrag: Annoying ass bill**\n\nOne annoying thing about Germany: every household must pay a monthly fee for the **Rundfunkbeitrag**, which is essentially a mandatory TV subscription that covers public networks, similar to Canada’s CBC. I have no idea why it’s required, but it costs me **€55 every two months**, and it honestly feels like money down the drain. Unfortunately, you cannot avoid this. If you live with a roommate, luckily it’s divided by your flatmates, so you might only pay like €10 or something. Still though, blehhhh.\n\n**32. International banking/transfering funds to and from your Canadian account**\n\nIf you're wondering about the best way to handle banking between Germany and Canada, I highly recommend the **Wise app**. It lets me easily link my German and Canadian bank accounts, making transfers quick and cheap—usually about €5 per transfer (although depends on the amount being sent), with funds arriving within 24 to 72 hours. It's been super helpful, especially for paying off Canadian credit card debt with my German income.\n\nI also regularly use my German N26 card, but I occasionally use my Canadian credit cards to build my credit back home. For example, since the Canadian dollar is weaker than the euro, I pay for services like Apple Music and Adobe Creative Cloud in Canadian dollars, which saves me money in the process and allows me to get the same things at a lower rate. \n\nConsider your options and choose what works best for you!\n\n**33. Taxes**\n\nIf you're leaving Canada for less than two years, let the CRA and your province know—you'll stay a \"factual resident\" and still get benefits like GST. You'll file a separate tax return in Germany for your income there, but you won’t be double taxed. Just send the CRA your German T4 (earnings slip).\n\nIf you're leaving long-term (2+ years), it’s best to become a \"non-resident\" for tax purposes. You won’t need to file Canadian taxes or report foreign income, but you’ll still be a Canadian citizen. Make sure to inform your health insurance and other agencies about your move.\n\nIt can be confusing and stressful, so do your research early and keep communication clear to avoid issues later.\n\n**34. Arts and culture in Germany: the bold truth** \n\nGerman culture is very different from what I expected. Unlike the openness and energy of places like Canada or North America, Germany—especially cities like Hamburg—is more reserved, quiet, and subtle. It’s not that culture is lacking, but it expresses itself in a calmer, more understated way.\n\nIf you’re looking for vibrant, loud, artsy energy like in Montreal or LA, Germany might not be the right fit. Many expats struggle because they expect that same openness here.\n\nBut if you’re coming to build resilience, grow personally, and live in a stable, logical country with nature, great infrastructure, and deep-rooted values—you’ll find a lot to love. For me, Germany has been grounding and honest. It’s not flashy, but it’s real. Living here has been the best chapter of my life and taught me so much about strength, confidence, and adaptation.\n\n**35. Closing words** \n\nSo, are you ready for a new life? I hope this guide helps you on your journey—it’s the one I wish I had when I first arrived. I’m sure I’ve missed a few things and will update it over time, but this should give you a solid starting point. Now go out there, give it your all, and get ready for an unforgettable adventure. You won’t regret it.", "author": "blueberrybong", "created_utc": 1745234151.0, "score": 7, "url": "https://www.reddit.com/r/germany/comments/1k4azmo/master_thread_youth_mobility_visa_for_canadians/", "num_comments": 38, "subreddit": "germany", "id": "1k4azmo", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Berlin WBS housing entitlement certificate, social housing, subsidized apartment, WBS WG", "selftext": "Hey,\n\nI have found a room and it is in a shared WG apartment which i'm super happy to have found something at all after 2-3 Months of searching. The exact newly discovered threshold or salary/income to be applicable for the WBS certificate is around 900 euro per month max (possibly) or a student.\n\nI'm in my mid twenties, working part time 3 days a week and unfortunately over the limited income amount, I still budget most months and money is of course apart of something sacred and a struggle. on the other hand most of the apartments and just alone rooms are falling into 800/900euro a month just for the rent which is totally over my budget and what i'm able to live within.\n\nI would really like some information or experiences if there is a way of still achieving this WBS as this room is my lifeline and only success story so far. I am also wondering if there is another way or required that could be possibly.\n\nI'm aware of the necessary documents they want i.e income statements, maybe the yearly paper that shows tax. I do some freelance work for costume and receive cash in hand for this service, I have some receipts just as a proof of payment it's not official though. Is that a possibility to explore and not mention my official part time job. Another point is that I'm aware of 3 people studying or registered as a student and working full time hours which does not seem to be fair.\n\nIs there a plan B? I have heard that the risk of homelessness is a possibility as i have one month to leave my current room?\n\nI was told to photoshop the documents for the certificate but I am aware it is a crime and the full impact of that decision..\n\nThank you!", "author": "RequirementMoney968", "created_utc": 1742721740.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1jhvdt2/berlin_wbs_housing_entitlement_certificate_social/", "num_comments": 3, "subreddit": "germany", "id": "1jhvdt2", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Student Visa job restrictions", "selftext": "Hii. I’m an MBA student in Berlin and I want to ask if in any case I do 2 part time jobs it can affect my visa renewal in September. I only job a 1st part time job this month and looking for a second to help pay off some of my fees for only a period. How do they verify the hours worked when you go to renew your visa permit. Thanks a lot for helping me.", "author": "AssociationQuiet631", "created_utc": 1741897784.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1jalwe7/student_visa_job_restrictions/", "num_comments": 6, "subreddit": "germany", "id": "1jalwe7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Getting a job as International Student in Berlin", "selftext": "Hi everyone.\n\nI am new here. I’ve been in Berlin since Oct 24. I am currently studying Bachelor of Computer Science and I am looking for a part time job to support myself here. I’ve been applying for over 40 jobs both online and in person but still no luck.\n\nI have previous Bachelor in Mechatronics and have 1.5 years of work experience in Academic field as Assistant and 1.5 years of content creator in EDM Industry. I speak very good English and currenly learning German A1. Apart from those skills, I am also a DJ and Music Producer(mainly house music)\n\nI would appreciate you all if you guys can give me recommendations, tips and tricks to get a part time job here. It’s been hard and depressing especially I’ve lost someone who is very special to me since I was born after arriving to Berlin. Thank you everyone. I hope you guys are all doing well! Much love!❤️", "author": "No_Degree6971", "created_utc": 1738765761.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1iib6wh/getting_a_job_as_international_student_in_berlin/", "num_comments": 4, "subreddit": "germany", "id": "1iib6wh", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "in search of Urgent Student Job (Mini /Part Time Job)", "selftext": "I am an international student living around Berlin and it has been a nightmare finding a student job around berlin. Tried applying with different cafe/restaurants and still trying on Zenjob (which always says Application under review or waitlist). Applied with amazon (got a callback for telephonic interview stuff, but said they will inform when the shifts are available - which never happened again). Flink is taking a life time to verify the documents. Tried with Lidl, Rewe and other supermarket chains, but got rejection (donno why) ..\nAny leads or sources or reference would help. \nGerman proficiency is very very basic.\nThanks in advance.", "author": "goul8998", "created_utc": 1738432204.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1ifbvl7/in_search_of_urgent_student_job_mini_part_time_job/", "num_comments": 2, "subreddit": "germany", "id": "1ifbvl7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Can I Find a Mini Job or Part-Time Job in Germany as a Foreigner with Basic German Skills?", "selftext": "Hello everyone,\n\nI’m an international student who is studying near Berlin. I’m curious about job opportunities for students like me, particularly **mini jobs or part-time positions**. However, my German language skills are currently very basic.\n\nDo you think it’s possible to find a job under these circumstances? If you’ve been in a similar situation, what types of jobs would you recommend I look for? Are there specific industries or places around Berlin that are more open to hiring students with limited German?\n\nI’d appreciate any advice, tips, or experiences you can share to help me get started. Thank you!", "author": "Routine_Gap9386", "created_utc": 1737546756.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1i79edv/can_i_find_a_mini_job_or_parttime_job_in_germany/", "num_comments": 5, "subreddit": "germany", "id": "1i79edv", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Which German city would be the best for me?", "selftext": "I am a student and currently live in Magdeburg. Although I think the city is okay, it's quite difficult to get a part-time job here as a foreign student. I would admit that my German is not the best, but I get by and can understand what others are saying. The university is also very mid and even a bit unorganized I would say and it seems like I would have to go to another city for a good internship. Also, the teaching style here is pretty bad to be honest. The city is pretty boring, there's not much to do here either, especially for foreign students. Also, the people here are not very open and it's hard to make German friends.\n\nNow that you know my situation, I have decided to change the city. I recently wrote my Feststellungsprüfung. I would like to move to a city where life is a bit more fun, but not as expensive as Berlin or Munich. And where it would be easier to get a part-time job and where the internship market is good.", "author": "5fxt", "created_utc": 1735226231.0, "score": 1, "url": "https://www.reddit.com/r/germany/comments/1hmqcys/which_german_city_would_be_the_best_for_me/", "num_comments": 2, "subreddit": "germany", "id": "1hmqcys", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "I’m struggling to get a part time job as a student. Any advice", "selftext": "Hey guys \nI’m 18M and I’m trying to find a part time job in Berlin to help fund my education and it’s insanely difficult to find one. Ive been trying to find a job for almost 2 months with no success \nAny advice or recommendations are very much appreciated.", "author": "NOTFDGOD_scam", "created_utc": 1734367758.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1hfnfer/im_struggling_to_get_a_part_time_job_as_a_student/", "num_comments": 6, "subreddit": "germany", "id": "1hfnfer", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Part-time jobs search", "selftext": "I'm a new international student in Berlin, Germany. I'm 23 yrs old and have more than 2 years of full-time work experience in my home country. I speak very little German as of now and currently learning to upgrade my language skills. What do you think is the best way to find a part-time job here? Are there any portals that you could suggest that would not be vague?", "author": "nikhil0__0", "created_utc": 1732448631.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1gyp62g/parttime_jobs_search/", "num_comments": 1, "subreddit": "germany", "id": "1gyp62g", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Need suggestion to earn money", "selftext": "Guys! I am international student in berlin, I am trying for part time job but couldn't get one/ still in process I want to earn money in cash but kinda of a legal way. Like I saw people play guitar and people give money or anything like that, so can you give some ideas?", "author": "Routine_Anxiety7394", "created_utc": 1731528998.0, "score": 1, "url": "https://www.reddit.com/r/germany/comments/1gqmds7/need_suggestion_to_earn_money/", "num_comments": 0, "subreddit": "germany", "id": "1gqmds7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Part-time jobs in Berlin", "selftext": "Hi everyone,\n\nI’m an engineer with 2 years of experience, and last month I moved to Berlin to pursue a master’s degree. I’ve been looking for part-time jobs that don’t require German skills, but I quickly realized there are hardly any available. I even applied for courier jobs, but they already have hundreds of applications\n\nI would appreciate any recommendations on how I can get a part-time or working student job", "author": "ApprehensiveNews5647", "created_utc": 1730458017.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1gh2ht1/parttime_jobs_in_berlin/", "num_comments": 2, "subreddit": "germany", "id": "1gh2ht1", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Integrating", "selftext": "Hi all iam M21 international student in Berlin I'm currently in my summer holiday and I work already a part time job but still have a lot of free time so I was looking for volunteering to integrate more in the society but I don't know what I could do that can be flexible and so... Open for any advice thank you in advance <3", "author": "Impressive-Low-5626", "created_utc": 1723134446.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1enaenq/integrating/", "num_comments": 4, "subreddit": "germany", "id": "1enaenq", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "International students studying in Germany, how is it like to live in these expensive cities like berlin, Munich, Hamburg, Stuttgart etc?", "selftext": "Is it possible to cover all your expenses with part-time jobs?\nAre you satisfied with your lives?\nHow often do you engage in fun activities?\nDo you have good social lives?", "author": "anonymouspot8", "created_utc": 1718795634.0, "score": 75, "url": "https://www.reddit.com/r/germany/comments/1djglfs/international_students_studying_in_germany_how_is/", "num_comments": 96, "subreddit": "germany", "id": "1djglfs", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Finding a part time job in Berlin", "selftext": "Finding Part time jobs in Berlin\n\nHey everyone, I'm a student living in Berlin for about 6 months now pursuing my masters in Automation & Robotics. I have been looking for permanent part time job here for a while now and apart from a few temporary gigs, i have mostly ended up empty. I just wanted to know which are some of the best places or best type of jobs i should be looking for since i'm still learning german. For odd jobs and otherwise, Which corporations usually hire expats who don't speak fluent german? Are Werkstudent jobs in Berlin startups a good option? What's the current situation like in the job market for English speakers in Berlin? Since summer is just around the corner is the situation slated to improve in the near future?\n\n\nAny help and suggestions would be greatly appreciated :)", "author": "stincerssd", "created_utc": 1711181597.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1bln3yb/finding_a_part_time_job_in_berlin/", "num_comments": 4, "subreddit": "germany", "id": "1bln3yb", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "University city or \"big\" city?", "selftext": "I'm planning to start my bachelor's in the next winter semester, and trying to decide which universities/cities to consider. I've heard a lot that as long as the university is not private, the quality doesn't vary insanely, especially for undergraduate studies. But what about cities?\n\nI originally come from a city of \\~650k population and that's considered small in my country, which is why the university cities in Germany seem REALLY small to me, at least statistically. I currently live in Ruhrgebiet, which I find incredibly ugly and also mostly boring but at least it's cheaper than most other places in Germany. I would still rather not stay in this area.\n\nFrom major cities, I'm considering Düsseldorf, although it doesn't really have much old and beautiful-looking architecture it's nevertheless generally a good-looking city. It's in a great position for traveling and not as expensive as Berlin/Munich/Hamburg but still quite expensive.\n\nFrom small university cities, I've been looking at Marburg, Göttingen, and maybe Erfurt and Erlangen too. These cities, at least from the pictures, look miles better than any city in NRW. Would it be harder to find part-time jobs as a student in these cities considering there are so many students and usually not many other cities nearby to go for work like NRW? And even if rents are a bit cheaper in these cities it is still not easy to find housing as a student.\n\nI would appreciate it if anyone who has gone from a big city to a small one in Germany could share their experience and if you found it too \"boring\".", "author": "potatodude99", "created_utc": 1708880094.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1azsmiy/university_city_or_big_city/", "num_comments": 12, "subreddit": "germany", "id": "1azsmiy", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Which university should I choose for M.Sc?", "selftext": "Hello everyone!\nI am a Product(Software) Designer from India. I completed my B.Tech in Computer Science and Engineering last year and applied for M.Sc. programmes in Human-Computer Interaction / Media Informatics at multiple German institutes this year in their summer semester. I  have fortunately received acceptance from four universities:\n1. Bauhaus University Weimar (M.Sc. HCI)\n2. University of Siegen (M.Sc. in HCI)\n3. University of Saarland (M.Sc. in Media Informatics)\n4. University of Duisberg-Essen (M.Sc. CE in ISE)\n\nI am awaiting results from two more universities: TU Berlin and University of Passau. Currently, I am very confused between Bauhaus and Duisberg-Essen as both have quite good curriculum and great rankings. I do understand that rankings are not the only criterion to use when selecting which place I should choose study in. \n\nI am a little familiar with German language as well, as I have completed A1 level certification from Goethe-Institut last year. Though, I still have trouble in speaking and listening to German (it is a work in progress). I wish to get involved in activities with locals and other international students (e.g. Art, Music, Yoga, Gardening, History are all my interests). And secure an part-time job(at the University) while studying and full-time one after graduation.\n\nI would be very grateful if I could get some personal opinions on these two universities: Bauhaus Universität Weimar and University of Duisberg-Essen, anything that might assist me in making a decision. My DMs are open, feel free to ask me more questions. I will be happy to answer!", "author": "Spideyyy01", "created_utc": 1706713853.0, "score": 1, "url": "https://www.reddit.com/r/germany/comments/1afk0np/which_university_should_i_choose_for_msc/", "num_comments": 12, "subreddit": "germany", "id": "1afk0np", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Appropriate tickets to buy by a recent graduate", "selftext": "Hello everyone! I was recently graduated from one of the universities in Berlin and currently I am looking for full time jobs to start my professional career (blaming market stagnation, though I’m not sure whether it is true 😅). Meanwhile I found a part time job related to my field of interest.\n\nAfter enjoying my student status (especially in transportation) where you pay a small fee and travel to/from all centres (ABC) without a hustle, now I must pay the whole price for the tickets. I have scavenged through many websites (including BVG) to know about the current ticketing options and that’s when I got more confused 🤪. Hope you guys can help me with this!\n\nMy question is: which ticket options are preferred for career starters that are budget-friendly and at the same time, cover for most of the traveling needs (all ABC centres)?\n\nRedditors, do your magic 🪄 ✨ \n\nP.s: I did masters in Logistics and Supply Chain Management. I might have to commute from Berlin to Brandenburg region as my working company is in Brandenburg area.", "author": "Sri_Krish", "created_utc": 1705214397.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1969l4i/appropriate_tickets_to_buy_by_a_recent_graduate/", "num_comments": 7, "subreddit": "germany", "id": "1969l4i", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "[Advice Needed] Part-time job employer refusing to pay per-hour at the last minute", "selftext": "Hallo! From September to November I worked for a psychology student in Berlin who is disabled and needed someone to help her do her project. The work was completely online, I have never met her. Studierendenwerk Berlin pays her some money each month proportional to the number of hours she has received help from somebody else to do the project. Before I started working, she told me that she would pay me 13€ per hour and that STW pays her 2 months later so I will get the money then. I had told her that 2 months is too late for me and I can only work if she can somehow pay me immediately after the month ends. She agreed. Now by the end of November, I had told her that would be my last month working. She had asked me to do a lot of work which I couldn't complete all of it. \n\nFrom September to mid October I worked 42 hours for which she paid me properly. From mid October to November I worked 40 hours and suddenly she says she does not trust that I worked so much and that STW only allows her to pay 30 hours per month. (The last time she split it into 2 months). She also said at the end that the pay is per task completed and since I had not completed some tasks (but I had made significant progress and the next person can just pick up from there) she would not pay for all my hours. For example, she had me do like 30+ graphs for some data on google sheets, took me 4 hours. 2 days later she had asked me to make some corrections for which I had to make them from scratch which she knew. This took me another 4 hours. 2 days later she says her lecturer asked to make some other changes. I had to make the graphs from scratch again which she knew. This took me another 4 hours. Now she tells me she can only pay me for 4 hours for making the graphs as the other 8 hours were incomplete work. Is she even allowed to do something like that? She says it is not in her control but she needs to prove to STW how much work is completed. But the form which I have to sign only has hours written, not tasks completed. So this does not make sense to me.\n\nSo for the 40 hours I worked, she first said she will pnly pay me for 19 hours. After I explained to her everything, she brought it up to 28 and is now refusing to pay for the remaining 12.  What should I do in this case? I have tried to reason with her. She first said she will pay me the remaining 12 hours in the next month's billing cycle but says she won't anymore. \n\nOther useful info:\n\n1. Since the beginning I had a google sheet where I entered what work I did every hour I worked for which she had the access to.\n2. We dont have a contract on paper but I have proof for everything by mail and Whatsapp.\n3. I can definitely prove that I worked for 40 hours and why exactly the work I did took 40 hours.\n\nThere is a lot more drama that happened since the last week of November which I can tell in comments if somebody is curious. I know the immediate advice is \"get a lawyer\" and that this subreddit cannot give legal advice. But any advice would be appreciated and I will try to get a lawyer once the christmas holidays ends. Should I contact her professor, or STW Berlin or Asta Berlin? \n\nThanks in advance!", "author": "Taeganger", "created_utc": 1703209517.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/18o3ehs/advice_needed_parttime_job_employer_refusing_to/", "num_comments": 2, "subreddit": "germany", "id": "18o3ehs", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Magdeburg vs Berlin vs Hannover to stay( specially in my case) Is it possible to travel from Berlin or Hannover to Magdeburg to attend class in 4-5 days a week.", "selftext": "I'm an international student and attending Magdeburg-Stendal UAS for my bechelor degree. I'm looking for some advice on choosing between Berlin, Hannover, and Magdeburg for accommodation and part-time job opportunities.\n\n1. **Travel and Class Attendance:** Is it feasible to travel from Berlin or Hannover to Magdeburg for classes, considering a 4-5 day per week schedule?\n(PLEASE SPECIALLY FOCUS ON FIRST Question)\n\n2. **City Preference:** Should I prioritize Berlin or Hannover when it comes to choosing a city, especially considering part-time job prospects?\n\n3. **Rental Expenses:** What's the cost difference in rental expenses for a shared room in Berlin, Hannover, and Magdeburg? I'm particularly interested in knowing about shared accommodation for two males.\n\n*Additional Info:*\n- Magdeburg: small city, fewer job opportunities, less travel distance to attend classes.\n\n- Berlin: , longer travel distance (1h40min), higher rent, big city with better job opportunities.\n- Hannover:, shorter travel distance than Berlin (1h20min), mid-range rent, good job opportunities.\n\nAny insights or personal experiences would be greatly appreciated! Thanks in advance for your help! 🙏", "author": "Zakaria2331", "created_utc": 1699639620.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/17s9x1h/magdeburg_vs_berlin_vs_hannover_to_stay_specially/", "num_comments": 9, "subreddit": "germany", "id": "17s9x1h", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Freelancing as a Non-EU student info", "selftext": "Hi, \nI know that is legal for Non-EU students to work on freelance activities and have a regular part-time job as well. I'm more interested in knowing the specifics of the process to obtain the permission from the German state. Is there a subreddit about this?\nWhere can I find info about freelancing as non-EU student?\n(Of course I’d pay taxes)\nThankss\n\nUPDATE: I consulted with a lawyer and it turns out that it is completely legal and allowed, at least in Berlin!  So go for it", "author": "Einhorner2321", "created_utc": 1691963563.0, "score": 2, "url": "https://www.reddit.com/r/germany/comments/15qbetn/freelancing_as_a_noneu_student_info/", "num_comments": 28, "subreddit": "germany", "id": "15qbetn", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "About working extra part-time jobs!!", "selftext": "I am an international student here in Germany and have been working part-time in Berlin. I would say the job is good and pays decent (I guess) for my efforts, however, recently I have been struggling to save money for myself. So was looking for a minijob to not only add extra cash but also engage myself during my free time. Havent been able to find a minijob though but have found a few extra part - time options. \n\nNow here is my question - is it possible to work 2 part-time jobs (contracts) at the same time? To my understanding if you do work at 2 jobs (regardless of it being full-time or part-time), and earn a certain level, they tax the hell out you. [Having a minijob is an exception I guess.] Is working 2 contracts strictly illegal or is it something down the line of \"not supposed to do but can\"? I have heard some people in my university working multiple part-time jobs and they seem to be doing fine. \n\nIf doable what can we expect? Is it just the probability of getting overtaxed or are there other repercustions? (A follow up question - if taxes are the only thing what % of taxes follow if for example, you get 1200€ /month from each job?)\n\nCheers and have a great day :D", "author": "Aka_Ashchin", "created_utc": 1685696320.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/13y7dqd/about_working_extra_parttime_jobs/", "num_comments": 11, "subreddit": "germany", "id": "13y7dqd", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Possible scholarships and funding options for master's in Germany?", "selftext": "Hi, I'm an international student from India. I'm planning on applying for a couple of 2-year master's programs in Cognitive Science in germany (potsdam, freie, berlin school of mind and brain). I  have previous academic background in philosophy. Getting into the uni shouldn't be a problem, the living expenses afterwards is. \n\nI was wondering if you have any suggestions on possible ways to fund my studies. I have been looking up DAAD page but haven't found anything suitable. Either it's not for this year or for this master's or for Indian students. Taking a loan isn't exactly an option. And I'm not sure how much can I rely on part time jobs as someone who doesn't speak German (yet). If I get in, I'll start from October 2023, so I need to find something that can cover my expenses from then on.\n\nAny advice or suggestions would be of great help! Thank you.", "author": "breadjupiter", "created_utc": 1682881940.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/1340bgq/possible_scholarships_and_funding_options_for/", "num_comments": 22, "subreddit": "germany", "id": "1340bgq", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "2 job contracts for non EU students", "selftext": "Hi everyone,\n\nI have a small question regarding jobs for students, with a background about my situation. \n\nI am a student in Berlin, and I was looking for part-time jobs but couldn't find one.\nI am in a situation where I am employed by two different companies(\"Zenjob\" and \"Trust promotion\"). Although even working with both of them, I am still not able to do 80 hours a month. So shall I keep working with both of them as long as I am able to manage my total working hours to be under 80 hours a week. Or is it kind of Illegal to be in this situation.\n\nAny kind Regards f help or guidance would be really appreciated. \n\nRegards,", "author": "Pitiful-Response5326", "created_utc": 1682439134.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/12ynw19/2_job_contracts_for_non_eu_students/", "num_comments": 3, "subreddit": "germany", "id": "12ynw19", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Work for a student in Frankfurt am Oder.", "selftext": "Hello neighbours!\n\nStarting next autumn I will be studying International Business (as a part of Double-Degree programme from Warsaw School of Economics) at Europa Universitat Viadrina in Frankfurt/Oder. I am currently working as a business consultant in an IT company in Warsaw and I earn quite decent money by Polish standards (i.e. still below the German minimum wage...).\n\nBy the time I arrive in Germany, I will have already a bachelor's degree in management (minor: management in E-Economy) from the University of Warsaw and one and a half years of experience in business. I am a native Polish speaker, have a C2 certificate in English and will probably have a B1 certificate in Russian. My German is however very basic (asking for direction and restaurant talk level).\n\nMy question is - do you think I would be able to find any white-collar work in Frankfurt/Oder? I would like to strengthen my business experience - and a job at McDonald's as a cashier is as good as empty spot on my CV. Or would you rather recommend finding something as a part-time job in Berlin and commuting?\n\nI would be grateful for any answers.\n\nThank you in advance!", "author": "Marcin222111", "created_utc": 1680601232.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/12bdvh8/work_for_a_student_in_frankfurt_am_oder/", "num_comments": 13, "subreddit": "germany", "id": "12bdvh8", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Affordable city for master studies with english job opportunities", "selftext": "Hello, I want to come to Germany for my master's degree in Educational sciences and the decision making process regarding which city would be good for me is a little overwhelming. The only three things that really matter to me are the cost of living, the demographic of the population (I'd prefer cities with students with somewhat of a vibrant social life, not anything crazy, but not drab either) and -most importantly- if I can get a part time job there with proficient English knowledge, but subpar German knowledge. For starters, I think the language barrier would be a problem for a small amount of time, I have my B1 degree in German already, so I don't think I'd struggle that much after a while, but at least at first, I'd have to get by with English. Is that possible? I'd guess that the bigger the city, the easier it'll be to get a job with only English as a prerequisite, but I don't know for sure. What's that situation like? Would it be better for me to choose cities like Munich or Berlin(I've found interesting programmes there)? \n\nI have given it much thought and I've done my research through [this post](https://www.reddit.com/r/germany/comments/u1pbf6/which_german_city_has_universityaged_people_and_a/) as well and I've found some beautiful cities, but the amount of information there is a little confusing, so I want to narrow it down a bit. Cities like Aachen or Munster seem incredible. If I can work there, I'd for sure prefer them over the bigger ones. They also have the advantage of being close to the Netherlands and Belgium.\n\nLastly, it's not a dealbreaker if they're not, but a city that's bike friendly would be awesome as I'm used to riding my bike around. \n\nThank you!", "author": "IgnatiosMp", "created_utc": 1672778656.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/102iuui/affordable_city_for_master_studies_with_english/", "num_comments": 17, "subreddit": "germany", "id": "102iuui", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Private school or 1 year language visa?", "selftext": "tldr: I'm moving to Berlin one way or another. In only 3 months, I can go to a (very) expensive private school that teaches in my native tongue, English, or  I can take a year, do an intensive language program in Berlin, hopefully pass a test, and hopefully get into a free German University, all in maybe 18 months time. What would you choose?\n\nFirst, I have to thank u/thewindinthewillows and u/staplehill for all their help. None of this would have been possible without both of you and I am extremely grateful.Here's a link to my [Original post](https://www.reddit.com/r/IWantOut/comments/yr6siy/iwantout_26m_student_usa_berlin_germany/).\n\nSo I finally did it. My perfect \\*Plan A\\* has come to fruition.\n\nI have officially been accepted to the International School of Management in Berlin. I have studied German like crazy these past 60ish days and tested at a B1 level on December 16th. My lease is up in March, and my work contract is up in late February. My ISM program would begin on the 13th of March. Everything is lining up perfectly, except...\n\nI am strongly reconsidering this path. I reread u/staplehill 's comment on my original post.\n\n>It would be a lot cheaper to come to Germany for a year on a language learner visa, attend a language course to get your German up to C1, and then study for a German-taught tuition-free degree at a public university [https://www.make-it-in-germany.com/en/visa-residence/types/other/language-acquisition](https://www.make-it-in-germany.com/en/visa-residence/types/other/language-acquisition)\n\nTheir idea is becoming more and more attractive as I am adding ISM's private university costs. Without small fees which I am sure will add up quickly, my acceptance email states as follows:\n\n>**Bachelor fee structure:**  \n>  \n>Before arrival on campus:  \n>  \n>Deposit: 3,000 € (refundable with the 1st semester)  \n>  \n>After arrival on campus:  \n>  \n>Enrolment fee: 1,500 € (non-refundable)  \n>  \n>Tuition fee\\*: 34,200 € (1st semester: 5,700 €, 2nd semester: 5,700 €, 3rd semester: 5,700 €, 4th semester: 5,700 €, 5th semester: 5,700 €, 6th semester: 5,700 €)  \n>  \n>Semester ticket (free use of public transportation): 1,800 € (300 € per semester)  \n>  \n>Total fee: 40,500 € (-3,000 € deposit) = **37,500 €**  \n>  \n>The German Embassy requests to open a **block account** with the amount of **11,208 €** for the **visa process**. This amount will be paid back in monthly instalments (934 € per month) during your first year of studies at ISM. We recommend to open this block account through FINTIBA ([https://www.fintiba.com/what-is-a-blocked-account/](https://www.fintiba.com/what-is-a-blocked-account/)) or Expatrio ([https://www.expatrio.com/products/blocked-account/exploration](https://www.expatrio.com/products/blocked-account/exploration)).  \n>  \n>Living costs including housing and food would be approx. 1,200 € per month.\n\nSo yeah. From what I have gathered on Reddit and other forums, a native German would balk at the idea of going to university for 37500 €. While that number seems reasonable or even low from my American standards, I understand that this might be a rather unjustifiable number that takes advantage of my ignorance and immigrant vulnerability. And let's face it, 0 (well... about 280 x 3 €) is a whole lot less than 37500 €. From r/germany's subbar:\n\n>Private universities, with the exception of a handful of well-regarded business schools, have a somewhat dubious reputation in Germany - they are seen as places where people pay for a degree which they would have been unable to get at a public university (presumably because they were not bright or hardworking enough). While degrees from most private universities are fully accredited, employers will likely question why the candidate didn't get their degree from a public university instead.  \n>  \n>Private universities which teach in English and copy many of the trappings of American universities (such as mandatory on-campus housing) are the worst offenders - they are seen as a trap to fleece ignorant foreigners.\n\nSo here I am at the great divide. I have what I have been working for for so long, yet now that I look at it, it might not be as great a bet as I imagined. So this \\*plan B\\* would be,\n\n1. find an intensive language school\n2. get a language learning visa\n3. move to Berlin3.5) hopefully find a job that doesn't mind my B1 level\n4. pass my TestDaF or Goethe Institute German Language Diploma (GDS)\n5. pass my Deutsche Sprachprüfung für den Hochschulzugang (DSH) for university\n6. apply for my student visa\n7. go back to america until I get my student visa\n8. hopefully get into a university I like in Berlin\n9. move back to Berlin and begin my studies\n\nThis whole process will take a minimum of a year, probably closer to 18 months. At earliest, I probably would be beginning my actual studies Winter semester 2024 at age 28 and a half. 6 semesters later I'll be 31, and a possible masters later, I'll be 33. As I have heard from many people now, this is not uncommon in Germany, as many people take advantage of free education and go later in life and multiple times. (although, I've been told that in general, Germans have more degrees because of this, rather than my mere bachelors).\n\nSo that's the long and short of it. Only thing holding me back from going with Plan B is that it feels like a gamble. I have a bird in the hand right now, and instead I am going to put it on the line to save money. My language learning abilities are not exactly my strongest suit. These last 8 weeks or so has been the most foreign language I have ever learned, despite both studying Spanish in high school and living in Thailand. I am fearful that I won't be ready for my exams at the end of the program and I will have to devote even more time. With ISM this is a non-concern, as the program is taught in English, with an intensive German course on the side. I also am reluctant to wait even longer to get my career on the road. Despite 31 being an acceptable age to enter your career in Germany, to me it already feels so late. I could be studying at ISM in less than 3 months.\n\nSo what would you do? Expensive bird in the hand versus a cheaper, maybe cooler bird in the bush. I have to accept or deny ISM's offer by the **3rd** **of January 2023.**\n\n&#x200B;\n\nSo here is my pro and con list:\n\n|International School of Management|1 Year Language Learning Visa|\n|:-|:-|\n|*+* I've already been accepted. The struggle is almost halfway done.|*-* I know little about this path. I have much work and research ahead of me to even get the ball rolling.|\n|*+* The education is taught in English. This might be helpful for the complicated topics I want to study, Economics and Finance.|*-* I have to trust my future German abilities to be strong enough to read and write complicated academic papers.|\n|*+* ISM's German Intensive Language program seems to be quite rigorous. They claim they can get a student from A1 to C1 in 6 semesters.|*+* Learning my education in German might be helpful, as I intend to work in these fields in Germany.|\n||*-* School rankings are not as pertinent in Germany. I have already had trouble determining German schools' worth, but I will have an even harder time in German. See  [https://www.reddit.com/r/germany/wiki/studying/general#wiki\\_rankings](https://www.reddit.com/r/germany/wiki/studying/general#wiki_rankings). (1/2)|\n|*+* ISM seems to be consistently ranked around the low 40's in international rankings. To me this seems pretty good, but again, rankings do not hold as much value in Germany as in the US. It is a hard metric for me personally to separate myself from.|*+*  That being said, when exploring international rankings of German universities, the first 20 are always public schools. (2/2)|\n|*+* Based off the schools website and LinkedIn profiles I have stalked, graduates of ISM seem to be successful, but...  (1/4)|*+* After googling around a bunch, there are countless successful politicians, lawyers, CEOS, and most importantly for me, CFOs who all received their first degree from a public German university.|\n|*-* The average student at ISM is extremely well off. During an interview with a... more open professor at ISM, he revealed that most students were quite well off and did not need any form of financial aid to fund their education. These students have had a leg up on the world and probably would have been successful regardless of their university. (2/4)|*+* As someone who has known poverty their entire lives until the last few years of their life, I do not relate as well to upper-crusters versus working class people. I might not gel with the young private school students. That being said... (1/2)|\n|*+*That being said, having powerful connections is a valuable asset. A large portion of my previous career was built upon whom I knew and what positions they'd held. Rich and connected friends can be quite helpful, especially in business. (3/4)|*-* Having well off friends and thus future business partners might be an advantage in the business world. It has been helpful in my life up until now. Public universities might not offer me those same opportunities. (2/2)|\n|*-* ISM runs very capitalistically. Their advertising and aggressive sales tactics remind me of exactly what I detest back home in America. I believe the \"Decide by Jan 3rd,\" ultimatum ISM has put on me is a high pressure sales tactic, as after some digging, I have found that I think I actually have until the end of January.  For-Profit education is something I am intrinsically against and misaligns with my personal values. (4/4)|*+* Socialized university aligns with my personal and political values. I would be honored to be a part of such a system. It is ultimately one of the reasons I want to move and raise a family in the country.|\n|*+* ISM has a heavy emphasis on internationality in their curriculum. As someone who will have lived in 3 different countries, my internationality might be a good trait to bolster.   One semester must be spent abroad, but... (1/2)|*-* My education might be purely Germany oriented. I would like the freedom of using my education world wide, should I want to go home. Will my future education at a public university allow me that freedom?|\n|*-* That abroad semester will cost me more money one way or another. I will be fluent in German and English. This limits my semester abroad university choices to German-speaking countries, English-speaking countries or English taught universities elsewhere like Bangkok University. While my ISM tuition would go towards tuition at those institutions, there is a high chance that the German or English universities would be more expensive and I would have to make up the difference. Even though Bangkok University would be cheaper, I still would have to make up the moving and living expenses. (2/2)|*+* The only costs I would have to concern myself with are education costs and costs of living. Various miscellaneous education costs have been estimated to be between 260 and 300 € a year and costs of living between 930 and 1200 € a year. I will also have to pay for extra flights to and from America while I wait for my student visa. This seems doable between my savings and a part time job. (1/2)|\n|*-* I will not have time to hold a job in addition to my studies. ISM states that they discourage a student accepting more employment than 10 hours a week.|*+* Many Germans work during their education. This would be essential to covering living costs as well as raising my quality of life. Plus, I value working. Labor is meaningful to me. (2/2)|\n|*-* ISM's student body is quite young. When I asked that same honest professor about the average student's age, he said that most first years are between the ages of 18 and 20. I would be the old man in this situation. I enjoy young people just fine and have no shame in being the odd-man-out, but again, social connections in your chosen field are a vital part of going to university. I might have an uphill social battle to secure and maintain relations with my peers.|*+* There will be many Germans and others in similar situations to myself in both life path and age. I should find it easy to meet and bond with my peers at a public school.|\n|*-* There seems to be a general distrust and scorn against private universities by the average German. Between Reddit, Youtube (see EasyGerman) and other forums, I have noted a significant disdain for non-public universities in Germany, ranging from \\[paraphrasing\\] \"it is the same or worse education for incredible amounts of money,\" to \"Most private universities are complete frauds and are little more than a trap to fleece ignorant foreigners.\" Reddit's r/Germany even states \"\\[Private universities in Germany\\] are seen as places where people pay for a degree which they would have been unable to get at a public university (presumably because they were not bright or hardworking enough). While degrees from most private universities are fully accredited, employers will likely question why the candidate didn't get their degree from a public university instead.\"  [https://www.reddit.com/r/germany/wiki/studying/general#wiki\\_public\\_and\\_private\\_universities](https://www.reddit.com/r/germany/wiki/studying/general#wiki_public_and_private_universities)|*+* Going to university for free through my own will and determination in another country in another language would be a very valuable accomplishment for me. I would feel prideful for my hard work and should I ever follow my dream of becoming a German citizen, I would consider it a valuable and important experience in my mental naturalization process. I would be experiencing something most Germans also experience.|\n|*+* ISM's program begins in March 2023, less than 3 months. This aligns well with both my lease and work contract ending. The transition will be smooth. I will get to start pursuing my dream in a very short amount of time. I will have my degree by early 2026 at age 30.|*-x2* I do not know how long it will take to begin this plan. It will most likely take longer than 3 months in visas alone. As a soon-to-be 27 year old, I do not have much time to spend. I need every minute I can get and the ambiguity of this plan costs time, not to mention the extra year that I will spend Language Learning. This will most likely add a year and a half to my plans landing me a degree at age 31.5 in Winter 2027.|\n|*+* This ISM program is essentially a sure thing. At this point, there is little left to chance, other than securing my visa, loans, and housing, the bulk of the uncertainty is over.|*-x2* At this time, there are many factors left to chance with this plan. I do not have a language program selected. I do not know if I will be able to get a job in Germany with my B1 language proficiency. I do not know if I will successfully pass my language tests. I do not know if I will find and be accepted into a University program that suits me. I do not know if I will be in a place financially to deposit enough into the Blocked Bank Account come mid-2024. All this on top of securing my visa twice and housing twice. My whole purpose of pursuing this degree is for a sure thing. I have already done the \"let's cross our fingers and hope this goes somewhere\" degree. I've devoted 10 years of my life to it. I am not trying to take anymore chances. This whole idea is supposed to be the safe option. This plan does not align with that sentiment.|\n|*-x3* The obvious one. The cost. **37,500 € is a freakin lot**. I will have to apply for loans and go into debt. No two ways about it. I have always paid off every debt I've had in less than a year. This will be something I am not proud of and will hang over me many many years into my career.|*+* 300 € miscellaneous costs times 3 years. round trip flights from Berlin to Phoenix cost around 500 € booked a month in advance. 1.400 € is a pretty damn cheap education. And I'd be doing it the German way.|\n\ndas macht zusammen:  \nISM 0  \nPublic +1  \nhmmmmmmmm...", "author": "ICanBeBetterIfITry", "created_utc": 1671637803.0, "score": 3, "url": "https://www.reddit.com/r/germany/comments/zrrkjp/private_school_or_1_year_language_visa/", "num_comments": 21, "subreddit": "germany", "id": "zrrkjp", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Student job / Part time job", "selftext": "Hi community! I am wondering the options for studentjob  / part time job available on the online platforms (linkedin, stepstone etc). I have applied to nearly 30+ positions till now but still not getting any positive feedback or even a call for interview. I know that German is a must and I can speak A1 till now but still there doesn't seem to be any opportunity. And I am applying for jobs like restaurant cooking help, production, logistics.....all things that does not require much talking.\n\nIs this really the case or am I doing anything wrong? Any suggestion on how to actually get a job or any improvement on CV???\n\nAnything would be of great help.\n\nLooking for jobs in Berlin/Potsdam\n\nThanks :)", "author": "pika_18", "created_utc": 1670266392.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/zdfs1a/student_job_part_time_job/", "num_comments": 7, "subreddit": "germany", "id": "zdfs1a", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Which university should I choose for a Bachelor of Computer Science: KIT or TU Berlin?", "selftext": "I understand that universities in Germany differ slightly, but I would like to hear the experience of students from these universities and find out where there are more problems when studying and where I can better master the material taught.\n\n&#x200B;\n\nKIT, as far as I understand, is considered more prestigious, but TU Berlin has been in the top positions in the ratings for the last two years. Despite this, from what I heard, there are problems with the organization of studies and exams at TU Berlin, besides, is it true that the material taught is a bit out of date? By the way, how are things going with the classroom equipment?\n\n&#x200B;\n\nKarlsruhe, on the other hand, is repulsive because the city is too small and does not have places for leisure. It also follows that while studying in a small town it is more difficult to find a part-time job and a job after graduation.\n\n&#x200B;\n\nIn connection with all of the above, it is difficult for me to make a choice. Perhaps you can help me and give a little more information than I have. :)\n\nP.S. I'm not a native speaker, so repulsive is a word that me a translator gave)", "author": "nsisyphus", "created_utc": 1661446561.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/wxjcng/which_university_should_i_choose_for_a_bachelor/", "num_comments": 10, "subreddit": "germany", "id": "wxjcng", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Would You Recommend Germany to an English Literature Student?", "selftext": "Recently, I applied to some German Universities and got admitted into 2 of them.\n\n1. University of Göttingen (MA in English Language, Literatures and Culture)\n2. FU Berlin (MA in North American Studies)\n\nWhile consulting different people about which one to choose based on the job prospects of the degrees, I started talking to an acquaintance who went to the same degree programme at the University of Göttingen back in 2020.\n\nShe stated that both degrees are similar and it really doesn't matter unless you are something specific like engineering, law and medicine. I asked her about the scope to enter the English publication houses or digital marketing firms after my masters. She said that I can apply but your level of German matters a lot. Unless you are in high tech, where english is preferred, people in other areas of work would prefer CVs with German proficiency.\n\nNow, I would like to clarify that I know that I need to know the local tongue in order to acclimatise to society. However, it is hard to become fully fluent when I am dealing with my degree, working part time and then learning german on the side.\n\nTherefore, before investing my money and time, I would like to get some clarification:\n\n1. What are the prospects of doing either of the two degrees in Germany?\n2. Are you aware of any publication houses who are willing to focus on my English rather than German, when I serve my CV?\n3. How hard is it to balance my course, a part time job and german lessons to reach B2 level at least?\n4. Will I be able to get part time jobs in either of the two cities without knowing German? Of course I will learn German, but I need to start working part time to sustain myself there?\n5. Finally, would you recommend Germany to an English Literature student? What are the career prospects there apart from PhD?\n\nThanks.", "author": "vocally-equivocal", "created_utc": 1657265318.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/vu4zw0/would_you_recommend_germany_to_an_english/", "num_comments": 27, "subreddit": "germany", "id": "vu4zw0", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "how's life in Hagen for international students?", "selftext": "Got admission in a Hochschule for masters. \nStill undecided whether to go or not. \nHope to get answers from fellow Germans. \n\n1. How's the monthly expense for single students there ? Is there housing crisis like Munich and other big cities? \n2. Is Hagen a rural area ? Or a proper city with all city facilities? Don't want to stay in a remote village area due to language issue ? Do people speak English there like Berlin? \n3. Crime rate? Racism etc? I hope it's not too much. \n4. Part time job scope, mini job, student job etc ? \n5. Do international student get any benefit like food bank? Free language class from government? \nAnything else, that I should know. Please add. Thanks.", "author": "taxi4sure", "created_utc": 1656675536.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/voyrdp/hows_life_in_hagen_for_international_students/", "num_comments": 28, "subreddit": "germany", "id": "voyrdp", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "How is life as international students in German cities like Saarbrucken, Magdeburg, Weimar and Bremen? I am planning to do MSc in Digital Media in universities in one of these cities. I am familiar with the course module but i am more concerned about getting part time jobs during my studies.", "selftext": "Hello everyone, i have done my **BE in Computer Engineering** from Nepal and i want to do **MSc in Digital Media or related field in Germany**. I have made list of some of the universities i want to apply for this winter semester (2022) and gone through the course module in detail. I am more concerned about life as international student in those cities.\n\n\\-**Chances of getting the part-time jobs during my studies considering most of the cities are not as big as Berlin or Munich or Frankfurt.**  \n **-How international students are treated specially for courses taught in English.**\n\n**Universities i have shortlisted:**  \n \\-Saarland University, Saarbrucken (MSc Media Informatics)  \n \\-OVGU Magdeburg (MSc Digital Engineering)  \n \\-Bauhaus-Universität Weimar (MSc CS for Digital Media)  \n \\-University of Bremen (MSc Digital Media)\n\n(I have got **2.14 GPA** according to German Grading System)  \n Waiting for suggestions from those who are studying or have studied in any of those Universities. ***Thank You in advance.***", "author": "DhakaTopi", "created_utc": 1643119452.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/scehh6/how_is_life_as_international_students_in_german/", "num_comments": 10, "subreddit": "germany", "id": "scehh6", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Fulda Vs bernburg as an international student / Married", "selftext": "Hey guys, I'm applying for bachelor degree in Business and for this summer semester my options would be in Fulda, Bernburg, Weiden, Berlin and if I wait for next fall aanchen and Trier + some more would be options. \n\nMy question is about cost of living and rent as I'm married and will bring my wife in 3-4 months. \n\nI see Fulda as the best option then bernburg but is rents are expensive in Fulda? Based on my research i simply can't find a lot of apartments.\n\nFor bernburg I saw some that were around 250-400 and good bernburg seems cheaper \n\n\nBut here is the problem for sure with both it will be hard for us to find part time jobs as well only speak English but at least fulda is bigger than bernburg. \n\n\nAnd for information we have like €22,000 so we have to find jobs for sure.", "author": "rawezh96", "created_utc": 1629978192.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/pbxsq7/fulda_vs_bernburg_as_an_international_student/", "num_comments": 10, "subreddit": "germany", "id": "pbxsq7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Is FHWS Schweinfurt a good University?", "selftext": "I am a foreigner and got admitted to an English mechatronics course at FHWS Schweinfurt. What should I expect from this University? Are the studies intensive? Will I have time for a part time job besides studying? Is the transportation system good in Schweinfurt? Is the cost of living high there? Do most people speak only German or do they know English as well?\n\n\nUPDATE: I have been living in Schweinfurt for 3 years now, here is my experience:\n\nI find the programme (IMC Mechatronics) to be very good. There are many decent professors. After 3 years of studying, i did not regret enrolling to this programme at all. I do have to say that there is a lot to study. If you want to become a good engineer, be ready to study well. Many of my colleagues unfortunately did not manage to finish this programme and switched to a less difficult one. The living expenses in Schweinfurt for a student amount to roughly 700€-800€ a month (rent, food, everything). Culture is pretty german. Not many locals know english. Do not expect it to be like in Berlin or München. Please learn german at least to level A2 before coming to study here, even if your degree (IMC Mechatronics) is in english. For a student, the city of Schweinfurt I find to be pretty, but boring. As soon as i finish my studies I plan to leave for a bigger city, because i‘m still young and want action 😄. You will observe that most people in here are over 30 years old. In terms of accommodation, start looking 6 months before coming in order to get the cheapest offers possible. You can use „wg-gesucht.de“ if you are looking to share an apartment with somebody. If you start looking 2 months before coming to Schweinfurt, you will be left (most likely) with the expensive rent options. It is definitely possible to work part time, but from experience there are mostly jobs like „storage worker“ or „cashier“ and other physical jobs. I tried to work part time while studying, but as a consequence i studied less and failed many of my exams. Its possible to work and study, but it is really hard to keep the balance.\n\nFinal verdict: Is it worth it to study here? If you want to become an engineer, learn the degree in english, pay only 200€ a year (because public education), and experience a new country, (if you are not from Germany)….\n\nYes, Schweinfurt is pretty worth it.", "author": "ClearSneer", "created_utc": 1626560374.0, "score": 12, "url": "https://www.reddit.com/r/germany/comments/ome1c2/is_fhws_schweinfurt_a_good_university/", "num_comments": 32, "subreddit": "germany", "id": "ome1c2", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Studying for a Law master’s degree in Germany", "selftext": "Hi everyone, im a Moroccan law student currently studying for a bachelor’s degree in law and thinking about pursuing my studies in Germany preferably in Berlin. \nI’m looking for any general advice like if law degrees in Germany are good or not, will i need to be fluent in german, what are the best public universities and what do i need to get in, how is student life there, is it possible to have a part time job and go to university at the same time, what type of housing is better (like campus or rent). Any kind of advice will help, thank you!", "author": "Figure_Vegetable", "created_utc": 1603226790.0, "score": 0, "url": "https://www.reddit.com/r/germany/comments/jey8t7/studying_for_a_law_masters_degree_in_germany/", "num_comments": 13, "subreddit": "germany", "id": "jey8t7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Landlord falsely witholding deposit for \"damaged\" oven", "selftext": "This is a follow up post to [this](https://www.reddit.com/r/germany/comments/6y2ucd/advice_needed_regarding_landlord_deposit/) thread, although it is quite long so I will try to include all the main details here.\n\nEssentially, our landlord in Berlin was trying to avoid paying taxes on renting her apartment by not having us registered (anmeldung). I wasn't aware of this and had registered to get a part time job over there. \n\nBecause of this she is getting in trouble with the tax office and is now trying to withhold our deposit by claiming that we left the apartment dirty (we didn't, it was at least as clean if not cleaner than when we got it and we took plenty of photos to prove it), and that the oven needs replacing because we apparently destroyed the hobs (they only had a normal amount of grease on them from wear and tear, once again we have a [photo](http://imgur.com/a/Dk2Xn)) to prove it was not \"ruined\" in her words. \n\nAlthough this is clearly all 100% bullshit and she is trying to scam our money so that she can pay whatever taxes that she owes, we are stuck on how to get her to return our deposit. I'm aware that it is probably time to send a legal letter from a lawyer but I would still rather try to get the money back by other means, as my girlfriend and I are students with not a lot of money and the cost of hiring a lawyer would take away a large chunk of our deposit anyway.\n\nI have heard that most apartments in Berlin have an overall building manager (Hazsverwalter?) that could asses the so called \"damages\" but I don't know the ownership situation for the building or how to contact them.\n\nSomeone also suggested trying to contact the Mietverien but I thought that you have to go there in person which isn't possible since we are now abroad and that there is a \"waiting period\" of a few months or a year after joining before they can help you? Is there any other body that could offer assistance on the situation or somewhere she could be reported. Or if not could you recommend an English speaking lawyer?\n\nThanks!", "author": "SeanMcG95", "created_utc": 1504802393.0, "score": 2, "url": "https://www.reddit.com/r/germany/comments/6yodz5/landlord_falsely_witholding_deposit_for_damaged/", "num_comments": 5, "subreddit": "germany", "id": "6yodz5", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Recommendations on bringing pets from the USA?", "selftext": "Starting the research phase of moving to Germany for a year or more. I'm an RF Engineer with a Software Engineering degree and I'm narrowing down my options to the following:\n\n1. Save up 3-6 months worth of living expenses, \"vacation\" for 3 months in Berlin while looking for jobs.\n\n2. Try to get a 12-month+ contract job before I go.\n\n3. Completely different: try applying to Film School in Germany as an international student, working a part-time job while I'm there and loving life.\n\nNow the question becomes: what do I do with my pets? I know Germany doesn't have quarantine laws, but apartment sizes seem to be much smaller, and not suitable for 3 pets (2 larger dogs and 1 cat). I can leave them at home for the first few months until I settle in, but apparently the animals then become a \"commercial shipment\" and the $$$ goes way up? Please correct me if I'm wrong.\n\nSo, any recommendations on moving to Germany, shipping pets, or overall advice would be greatly appreciated.\n\nBONUS: What tech industry is Germany most in need of right now? I can learn any programming language, and I also do VR development.", "author": "ViveMind", "created_utc": 1500217482.0, "score": 2, "url": "https://www.reddit.com/r/germany/comments/6nmlv7/recommendations_on_bringing_pets_from_the_usa/", "num_comments": 23, "subreddit": "germany", "id": "6nmlv7", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "So you want to study [undergraduate] in Germany?", "selftext": "Due to the recent news of Germany abolishing tuition fees on a national level I thought I could share my experience as a non-EU foreigner (American) going through the German university application process. Warning: If you expect this process to be easy, you're absolutely wrong.\n\nNote: If you from Australia, Chile, Hong Kong, Israel, Japan, South Korea, New Zealand and Taiwan and are between 18 and 30 you can get a 1 year working holiday visa. If you're Canadian and between 18 and 35 you can get a 1 year working holiday visa (as long as you show proof of sufficient funds for a few months). This means you can move to Germany for a while before applying.\n\n**Step 1: Find a German University that offers a program you're interested in.**  \nGermany, unlike the United States, requires you to choose your degree program before enrolling. You do not just take a little of this and a little of that until you decide what to do. **Most undergraduate degree programs in Germany are taught in German, not in English.** [Here](https://www.daad.de/deutschland/studienangebote/international-programs/en/?p=l&q=&degree[]=1&subject=0&lang[]=2&langDistribution=0) is a list of German university programs in English. [Here](https://www.daad.de/deutschland/studienangebote/studiengang/en/?a=result&q=&degree=24&courselanguage=&studylocation=&locations=&admissionsemester=&sort=name&page=1) is a list of all German university programs.\n\n**Step 2: Organize your needed materials to apply. Ex: High school diploma, SAT scores, ACT scores.**  \nIf you did not graduate with at least a 3.5 GPA, and get high scores on your SAT or ACT with writing, turn back now. German universities only let in a fraction of international students for each German student, because they want to educate their citizens first. For the degree program I selected at HTW in Berlin they allowed a total of 50 students in each year and only 7 were allowed to be international.\n\n**Step 3: Submit a uni-assist.**  \nInternational students wishing to study in Germany must submit their applications via Uni-Assist. It costs 75euro for the first university application, and 15euro for each additional one for the same semester. If you wish to apply to another program for a later semester you must pay 75euro again. (75EUR is roughly $95.) From my experience uni-assist takes a loooooooooong time. My process was streamlined because I lived in Germany and was able to drop off my applications in person at the office.\n\n**Step 4: Wait.**  \nNow you wait to find out if you were accepted. Unlike the United States, you will NOT find out months before the semester begins. Most likely you'll find out 1 month or so before. This will make moving to Germany a bit rushed.\n\n**Step 5: The response.**  \nYou will receive a response from your university as to whether or not you were accepted. If you weren't, sorry. It's a tough process. You can try again, but honestly I would just forget it and try another country if you MUST study in Europe (The Netherlands offers MANY courses in English, but is not free). If you were accepted, congratulations! Now your headaches really begin!\n\n**Step 6: The visa.**  \nTo receive a student visa in Germany you must be enrolled in a university. Once you've received your acceptance letter you can accept the spot and have to pay fees. *What do you mean fees? Germany just got rid of their fees!* Yes, they got rid of their tuition fees, but not the other ones. You still have to pay a few hundred Euro per semester for student organizations and your train ticket. It is worth it though, the ticket comes at a highly discounted price.  \nOnce your fees are paid you will get proof from your university that you are enrolled. Now comes the fun. If you're in your home country you contact the German embassy/consulate to start the visa process. If you're in Germany.. lucky you! You get to go to the Auslaenderbehoerde! What is the Auslaenderbehoerde? Well, it's the first German word I learned to spell in my sleep. They are the foreign office tasked with helping us non-EU citizens get visas. And boy are they a friendly bunch!  \nTo get a student visa in Germany you will need proof that you can sustain yourself. You need roughly 8000EUR (roughly $10,000) in your German bank account at the beginning of the school year, each year. What does this mean? Either your parents need to sign a statement that they will 100% support you and give proof with bank statements showing they have enough income to give you the money. You can also get scholarships (more on this in a second), get a loan (from Germany, which is hard to do), or have a permanent German resident (citizen or not) sign a declaration that they will financially support you. Keep in mind, German degree programs last between 3 and 4 years, so you will need in total $30,000 or $40,000 to just get your visa for each of the years.  \nYou NEED health insurance. Your university can help you get this sorted.  \nOnce you have all of this covered: Congratulations! Time to move to Germany!\n\n**FAQs**\n\n1. **What about scholarships?**  \nGermany offers very few scholarships, especially for undergraduate studies. You can find some at the [DAAD](https://www.daad.de/deutschland/stipendium/en/), but prepare to be disappointed.\n2. **So I got accepted and my visa is sorted out, what about living situations?**  \nGerman universities typically do not offer student housing. Some do, but the amount of places is very limited and it fills up very fast. Most likely you'll need to find a WG (apartment share) in the city where you're studying. You can search for a WG [here](http://www.wg-gesucht.de/). In most cities these fill up very fast and you will need to go for an interview. You'll have a difficult time finding a place to live when you're not in the country.\n3. **$10,000 per year? Will this be enough for me to go out and party?**  \nSimply put: No. This will cover your living expenses, health insurance, and food costs.\n4. **What? So then how am I supposed to do things?**  \nLuckily, on a student visa you can get a job. Only a part time job, but still. You can work either 90 full-time days a year or 180 part-time days. Finding a job will be difficult if you don't speak German and do not live in a major international city. Berlin would be the easiest to find work without needing to speak German. But be warned, English is a dime a dozen. You are not unique because you speak English.\n5. **Do I need to speak German?**  \nShort answer: Yes. Long answer: Yeeeeeeeeeeeeeeesssssssssss. While many of your friends you make at school will speak English, you'll need at least basic German to get by in every day life. Important documents must be done in German, bank accounts are opened in German, rental agreements are usually in German, and obviously people around you will speak German. Speaking *some* German is not enough. It might be if you want to move to Germany and never do anything other than hang out with other English speakers, but if you want to really appreciate the country and culture, learn some damn German.\n\nIt has been a few years since my application procedure, so please feel free to correct me if I have misremembered anything. If there's anything I've missed, please add it as well.\n\n**List of important resources**  \n[DAAD - Deutscher Akademischer Austausch Dienst - German Academic Exchange Service](https://www.daad.de/de/)  \n[Uni-Assist](http://www.uni-assist.de/index_en.html)  \n[Study-In-DE](https://www.study-in.de/en/)  \n[Study in Holland \\(just because!\\)](http://www.studyinholland.nl/)\n\nI will end this by saying Germany is a fantastic country. I lived there for years, made friends for life, and have wonderful memories. I miss it every day with every fiber of my being and hope some day I'll be back. Studying in Germany is much more difficult and more rigid than the US. You'll be in class 5 days a week and for most of the day. Don't eat out often, and buy beer from the grocery store and you'll be fine.\n\nEdit: Thank you everyone for the feedback. There is tons of great info in the comments, so I urge everyone to read them! I would like to clarify that not every experience will be 100% like mine. Hopefully you won't take a hour and a half u-bahn and bus ride to Uni-Assist only to realize you forgot your paperwork at home!\n\nIf you have any specific questions please feel free to shoot me a PM and ask away! If I can't answer your question I'll try to point you in the direction of someone who can.\n\nI am in no way an expert at this process nor am I associated with any universities.\n\nEdit 2: I am still receiving many PMs from this post. It seems the main point I'm trying to make is lost on many of you so here it is in back and white: **This will NOT save you money. You need about $15,000 PER YEAR just to survive.** You cannot get a loan. You need to have the money in the bank or have your parents pay to keep you going. If you happen to have about $60,000 in the bank then just go to undergrad in the US, take German classes, and do your master's in Germany.", "author": "DeineBlaueAugen", "created_utc": 1412244606.0, "score": 525, "url": "https://www.reddit.com/r/germany/comments/2i2trw/so_you_want_to_study_undergraduate_in_germany/", "num_comments": 160, "subreddit": "germany", "id": "2i2trw", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Pros/Cons of cities in DE for a university student", "selftext": "My plan is to enter a German uni in the winter semester. I've ruled out the south and the west, since they're apparently more expensive in terms of cost of living. The north is good, since it's close to Denmark and my bf lives there, but I'm also considering the east because I've heard cost of living is super low and the unis have lots of open places. I have enough money to subsist at a basic level for a year, but I'm going to need to pick up a part-time job to sustain myself beyond that. The cities with universities I'm considering are:\n[North:]\n*Bremen\n*Hamburg\n*Greifswald\n*Lübeck\n*Oldenburg\n*Rostock\n*Kiel\n[East:]\n*Berlin (note: this is my favorite city in DE, but I have a low-ish chance of getting in here. No need to tell me how great Berlin is, I know already)\n*Leipzig\n*Magdeburg\n*Jena\n*Halle-Wittenburg (Halle)\n*Potsdam\n\nQuestion to anyone familiar with any of these cities: what are the pros and cons? What have been your experiences with these cities, and which would you choose?", "author": "tebrmc", "created_utc": 1397094166.0, "score": 6, "url": "https://www.reddit.com/r/germany/comments/22nqan/proscons_of_cities_in_de_for_a_university_student/", "num_comments": 7, "subreddit": "germany", "id": "22nqan", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Applying for MSc Physics as a BEng Mech. Eng. Graduate", "selftext": "Hi r/germany, I'm looking for a little advice.\n\nI graduated this summer with a BEng in  Mechanical Engineering from a top 20 UK university and am looking to study for a masters in physics in Germany. I have identified a number of universities that teach in English (as my German is not yet up to scratch) and have been looking at prerequisites for their courses. I am aware many universities use competency tests but I need to get past the first level of application to face them.\n\nIn general, they require a BSc in physics, but also accept mathematics and natural sciences degrees. I would argue that my degree is just as relevant to physics as a biology or maths degree. (Also, my bachelors is actually aeronautical, not mechanical engineering, but they have a lot of cross-over and the latter is far more well known. I would say aero has more fluid dynamics than mech though I'm not so sure on what we missed out on).\n\nI have a few questions:\n\n1. Is my bachelor degree relevant enough? If not, is it typically possible to take a selection of undergraduate courses to 'convert'?\n2. Is the admission competition for prestigious universities high at postgraduate level? Specifically, is it realistic to apply to LMU, TUM, HU-Berlin, KIT, etc. with a 2:2 non-physics degree?\n3. Are part time jobs available for students with only basic German? Is there any other way a foreigner can ease the financial burden? (Munich and Berlin are my favoured cities)\n\nThanks for reading, if there's anything I neglected to ask that you feel would be useful please let me know too!", "author": "german__throwaway", "created_utc": 1380078214.0, "score": 3, "url": "https://www.reddit.com/r/germany/comments/1n2tdj/applying_for_msc_physics_as_a_beng_mech_eng/", "num_comments": 6, "subreddit": "germany", "id": "1n2tdj", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "35/M/EU Citizen/US -> Europe for grad school and career", "selftext": "Hello Redditors! Long time reader, first time poster who appreciates any suggestions.\u0003\n\nI and a 35 year old American man who lives in Oakland, California. English is my first language. I have been working as a server in a fine dining restaurant for many years and make a reasonably comfortable salary for the area. I have an undergraduate degree in English with a minor in Italian studies. I applied for and received an Italian passport. I have saved up enough money over the years and am considering using it to move abroad, or use it for a down payment on a condo which I can then rent out when I move away. In this respect my budget is dependent on whether or not my money is tied up in property, and is somewhat flexible.\n\nI have applied for numerous English-language master's programs in Europe in the field I would like to work in (I will outline this in a bit) but have found it difficult to be accepted without a background in it. My interests are broad and I would like to find a country and a school with a master's degree that will prepare me for a career change after having finished school 13 years ago.\n\nLiving near and working in San Francisco has accustomed me to a certain level of diversity and quality of life. I am looking for somewhere to study for a couple years (2 year programs only) that will be provide something similarly interesting but in a different context (i.e. no provincial backwaters, please, unless there is something to be gained from the experience).\n\nMy ultimate goal is to work with the Foreign Service after gaining some practical experience in international work. This means taking my background in the humanities and transitioning it to one in the social sciences. I would like a broad interdisciplinary field containing elements of political science, philosophy, sociology, psychoanalysis, history, anthropology and cultural theory (imagine a Slavoj Zizek University and I'm there). I have lived in Italy for school and speak Italian and Spanish, but I am not interested in living in these countries.\n\nI am particularly interested in continental/Northern Europe in preparation for an international career. Only public universities with free or very low tuition. I am looking at Berlin, Paris, Copenhagen, Helsinki, Uppsala, Vienna, Leipzig, Brussels, Amsterdam, Leuven. Ideally I would also learn a new language while studying in English, preferably French or German, although I've found only one masters that meets my criteria that is taught in English in France (Paris Diderot's American/English studies). In Berlin, both Freie and Humboldt seem to have programs that are professional and theoretical in nature. They are tuition-free and provide a transit pass for the city.\n\nBased on what I have written, what are some of the ideal places to study in Europe? Where else should I consider? Is there anywhere that can offer a culturally interesting/unique study environment at a relatively low cost of living for a student? I like the subsidized nature and social structure of Northern Europe, and have heard that the Danish government pays a stipend to students who work a part-time job while going to school. The quality of life this would allow is appealing to me. Are there any other places or schools with similar opportunities I should be aware of? I am also open to the idea of staying in the country where I've studied if I am able to support myself comfortably.\n\nThank you in advance for any suggestions, consideration or advice!", "author": "rockrotandrule", "created_utc": 1563659065.0, "score": 0, "url": "https://www.reddit.com/r/IWantOut/comments/cfrb2o/35meu_citizenus_europe_for_grad_school_and_career/", "num_comments": 12, "subreddit": "IWantOut", "id": "cfrb2o", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "27 M USA > Germany", "selftext": "So I’m 27 from NYC and looking to move to Germany. I’ve done some research on the residency permit and I don’t have a lot of hope for attaining a working visa.  I have a BA in Business Administration but I graduated in 2015 and have done very little with that degree since. I’ve been in the accounts receivable department of a store for the past 6 years and I’m not sure if I have any marketable skills.  So I was thinking about applying to graduate school at a public university and working part time on a student visa. Not gonna lie, my knowledge of German is nonexistent so that’s limiting the amount of graduate programs I can apply to as well as potential job prospects. I have about 10k saved up so I think I have that part of the living expenses on the application process covered.  Forgot to mention that I’d like to go to Berlin, my friend lives there and is willing to let me live in their apartment so that I wouldn’t have to worry about rent or declaring an address on my application papers. \n\nI’m saving up more money just in case I don’t find a job and trying to learn German on my free time. \n\nRealistically what are my chances of getting accepted into a graduate school? Finding a part time job in Berlin?", "author": "alexburnshred", "created_utc": 1554508608.0, "score": 1, "url": "https://www.reddit.com/r/IWantOut/comments/b9ygh5/27_m_usa_germany/", "num_comments": 3, "subreddit": "IWantOut", "id": "b9ygh5", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "How to Germany: Work & Study +++ The Ultimate Guide", "selftext": "**Content of this site**\n\n1. How to work in Germany\n\n2. Perspective: Permanent residency and citizenship\n\n3. Job benefits\n\n4. How to study in Germany\n\n5. What foreigners in Germany say about their experience\n\n\n**How to work in Germany**\n\nYou can live and work in Germany if you fall under one of the following categories:\n\n* you are [refugee from Syria or another war-torn country](http://www.bamf.de/EN/Infothek/FragenAntworten/ZugangArbeitFluechtlinge/zugang-arbeit-fluechtlinge-node.html)\n\n* [your ancestors were Jews or belonged to another targeted group in Nazi Germany](http://www.germany.info/contentblob/5115626/Daten/30703/Information_on_Natur_Claim_Art116.pdf) and were expatriated between 1933 and 1945\n\n* you are citizen of [United Kingdom, Romania, Hungary, Greece, Slovakia, Poland, Slovenia, Austria, Belgium, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Ireland, Lithuania, Italy, Latvia, Lithuania, Iceland, Luxembourg, Malta, Netherlands, Liechtenstein, Portugal, Norway, Spain, Sweden, Switzerland](https://en.wikipedia.org/wiki/European_Economic_Area)\n\n* you are citizen of [Australia](http://www.sydney.diplo.de/contentblob/2600088/Daten/999367/Datei_WorkingHolidayVisa.pdf), [Canada](http://www.canada.diplo.de/yma), [Japan](http://www.japan.diplo.de/Vertretung/japan/ja/02-Service/021-visa/WH.html), [New Zealand](http://www.wellington.diplo.de/contentblob/4903154/Daten/7798761/Info_Sheet_Working_Holidays.pdf), [Hong Kong](http://www.hongkong.diplo.de/contentblob/3493432/Daten/7813817/workingholidayvisa.pdf) or [Taiwan](http://www.taipei.diplo.de/whv-dt), not older than 30 or 35 (Canada) years, and want a work permit for 1 year\n\n* you [study at a German university](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#visa-for-studying) (you can work part-time during your studies, namely 120 full days or 240 half days per year)\n\n* you [graduated from a German university](http://www.make-it-in-germany.com/en/for-qualified-professionals/training-learning/study/studying-in-germany-and-after/residence-permits-for-postgraduates)\n\n* you are a trained nurse, midwife, plumber, welder, carpenter, roofer, drywall installer, railway worker, auto service technician, software developer, or one of the about 100 other occupations on the [whitelist](https://www3.arbeitsagentur.de/web/wcm/idc/groups/public/documents/webdatei/mdaw/mta4/~edisp/L6019022DSTBAI777367.pdf) and want to work in this field\n\n* you want to learn one of those [whitelist](https://www3.arbeitsagentur.de/web/wcm/idc/groups/public/documents/webdatei/mdaw/mta4/~edisp/L6019022DSTBAI777367.pdf) professions and [start a job training program there](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#visa-for-training)\n\n* you want to work in a field where they need someone with your native language, for example as a teacher for English or your respective language, in a bilingual nursery or [as an au pair](https://www.aupairworld.com/en/au_pair_program/germany) for parents who want their children to learn your language. Examples: [Rose](https://www.youtube.com/watch?v=Oi6rYu2Hm7A) from Kenya, [Aspen](https://www.youtube.com/watch?v=EzNhsE6VyXA&feature=youtu.be&t=1m38s) & [Hayley](https://www.youtube.com/watch?v=2EnNYnlNA7Y&feature=youtu.be&t=2m29s) from the US\n\n* you [want to work as a cook and are qualified to prepare typical dishes from your home country](https://www3.arbeitsagentur.de/web/wcm/idc/groups/public/documents/webdatei/mdaw/mte4/~edisp/l6019022dstbai394995.pdf)\n\n* you study and want to [work as an intern](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#visa-for-an-internship)\n\n* you have a university degree which is [comparable to a German degree](http://anabin.kmk.org/no_cache/filter/hochschulabschluesse.html) and a company wants to hire you for [a STEM job where you earn more than 39,624 euro per year](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#work-visa)\n\n* you have a university degree which is [comparable to a German degree](http://anabin.kmk.org/no_cache/filter/hochschulabschluesse.html) and a company wants to hire you for [any other job where you earn more than 50,800 euro per year](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#work-visa)\n\n* you want to work as a [scientist, researcher, teaching staff or executive for a university or a research institution](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#visa-for-research)\n\n* you want to freelance, for example as [stand up comedian](https://www.youtube.com/watch?v=cWHtkAUTAcc), [social media adviser](http://blog.cloudpeeps.com/how-to-get-the-berlin-freelance-visa/), [designer](https://medium.com/@imcatnoone/how-to-get-your-german-freelance-visa-without-losing-your-sanity-8fa68b39431a) or even [for foreign companies](https://www.bemytravelmuse.com/how-to-get-german-freelance-visa/)\n\n* your employer [shows to the government why they want to hire you over a German, European or refugee](https://www3.arbeitsagentur.de/web/wcm/idc/groups/public/documents/webdatei/mdaw/mtaw/~edisp/l6019022dstbai651347.pdf), for example because you are better qualified than other people or because there is a general labor shortage in your profession or simply because no German, European or refugee is currently available for this job\n\n* you are married or [civilly united](https://en.wikipedia.org/wiki/Civil_union) to someone who lives in Germany (a German, an EU citizen or a foreigner with a legal immigration status other than student)\n\n* you don't know yet what you want to do? You can get a [6 months visa](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/kinds-of-visa#visa-for-jobseekers) to search for a suitable job in Germany.\n\n**Long term perspective**\n\nAfter 5 years with a job, you can get a permanent [settlement permit](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/settlement-permit) (Niederlassungserlaubnis). Now you can stay in Germany forever, even if you lose your job. You can also switch your occupation without being limited to any categories. The time span is shorter for graduates of German universities ([2 years](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/settlement-permit#graduates-of-german-universities)), Blue Card holders ([21 or 33 months](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/settlement-permit#eu-blue-card-holders)), highly qualified professionals ([0 months](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/settlement-permit#highly-qualified-professionals)) and self-employed ([3 years](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/settlement-permit#self-employed-persons)).\n\nAfter [8 years with a job, you can become a German citizen](http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/naturalisation#who-is-entitled-to-naturalisation).\n\n**Job benefits**\n\nMinimal benefits required by German law for every job:\n\nat least 4 weeks of paid vacation per year, often 6 weeks\n\nabout 10 additional paid public holidays\n\nreal health insurance that covers everything, see [our FAQ](https://www.reddit.com/r/germany/wiki/health_insurance)\n\nYou can stay at home if you are sick: https://youtu.be/_O1QdpMCHrU?t=4m47s\n\nWhile you are sick, you 100 % paid for the first 6 weeks and 70 % for the following 18 months\n\n15 months of paid family leave - 2.5 of those are mandatory, the woman is not allowed to work even if she wants (but she still gets paid)\n\nchildren benefits: about 2400 Euro per year per child\n\nthe guarantee to find a nursery school for your children, starting with their first birthday\n\nfree schools and universities\n\nfree health insurance for your children until they are 25 or get a job\n\nChild illness benefits: If your child (11 years or younger) gets ill and you have to take care for your child, you get paid 90 % of your net income for up to 20 days per child per year\n\nHigh legal hurdles for employers to fire an employee\n\nHere is a page with all children benefits: https://www.reddit.com/r/germany/wiki/children\n\n**How to study in Germany**\n\nMore than 1.000 programmes are taught in English: https://www.studying-in-germany.org/international-programmes-germany/\n\nTo study at a public university you have to pay an administrative fee of usually 300 to 800 euro per year (350 to 900 USD), you get a 24/7 public transport ticket in return. \n\nTo get a student visa you need an admission letter from a university and you need to prove that your livelihood is secured, which is the case if you have 8.820 euro for your first year in Germany. You either have the money on a bank account or you have a scholarship or you have parents with a high income who promise to pay for you, etc.\n\nIf your educational background is equivalent to the educational background of German high school students, you can enter German university directly. Otherwise, you have to attend a foundation course, called Studienkolleg, first. To find out, you can use the [Anabin](http://anabin.kmk.org/no_cache/filter/schulabschluesse-mit-hochschulzugang.html#land_gewaehlt) database (click \"Suchen\" and then chose your country), which is unfortunately only available in German.\n\nDuring your studies, you can work part-time (120 full days/240 half days per year). After your studies, you get an automatic resident and work permit: http://www.make-it-in-germany.com/en/for-qualified-professionals/training-learning/study/studying-in-germany-and-after/residence-permits-for-postgraduates\n\n8 years later you can become German citizen: http://www.make-it-in-germany.com/en/for-qualified-professionals/visa/living-permanently-in-germany/naturalisation\n\nHere are some videos where Bharat talks about part-time jobs for international students and cost of living: https://www.youtube.com/watch?v=90b5Rqyxq8E\n\nhttps://www.youtube.com/watch?v=0Hh_yiG0hgQ\n\nWhat foreigners say about studying in Germany:\n\nKate: https://youtu.be/H2fbX-siLa0?t=15s\n\nDana: https://youtu.be/cNo3bv_Ez_g?t=3m\n\nBharat: https://www.youtube.com/watch?v=T-BU9d27m48\n\nHayley: https://youtu.be/uSlwuS_zxmQ?t=6m\n\nFull guide how to study in Germany: https://www.reddit.com/r/germany/wiki/studying\n\n**But why Germany???**\n\nDana talks about work-life balance: https://www.youtube.com/watch?v=dN3k5-YmQUE\n\nAspen talks about job benefits: https://www.youtube.com/watch?v=zIq0gqRQBH4&feature=youtu.be&t=4m58s\n\nBrian talks about child raising: https://www.youtube.com/watch?v=9voe7gOFzo0&feature=youtu.be&t=12m16s\n\nAntoinette Emily talks about giving birth to two children in Germany, especially the out of pocket payment for hospital and midwife: https://www.youtube.com/watch?v=YZaGMXSLnts&feature=youtu.be&t=2m10s\n\nAspen talks about the freedom to express your emotions: https://www.youtube.com/watch?v=4AostYMOmhQ&feature=youtu.be&t=1m29s\n\nFeminewbie talks about sick leave, paid maternitiy leave and the value of life: https://www.youtube.com/watch?v=_O1QdpMCHrU&t=4m29s\n\nHaley talks about vacation, health insurance, universities, beer, paid maternity leave, and gun control: https://www.youtube.com/watch?v=uSlwuS_zxmQ&feature=youtu.be&t=1m18s\n\nTyler: https://www.youtube.com/watch?v=gpBc2_R1Bv4&feature=youtu.be&t=8m51s\n\nNalf: https://www.youtube.com/watch?v=rweuhvp8u2k&t=45s", "author": "staplehill", "created_utc": 1509108440.0, "score": 76, "url": "https://www.reddit.com/r/IWantOut/comments/79304n/how_to_germany_work_study_the_ultimate_guide/", "num_comments": 4, "subreddit": "IWantOut", "id": "79304n", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Getting my BSc in CS&E in a semester (or an year tops). Where could I continue my studies?", "selftext": "Backstory: I'm a Hungarian Computer Science and Engineering student who just fucking wants the hell out of here because the current government is turning the country into a dictatorship and the stupid sheeple cheer for it. I speak English fluently, German and Spanish pretty well and a bit of Japanese. I could also learn a Romance or Germanic language in a fairly short time (I understand written Italian and Swedish pretty well already).\n\nI want to continue my studies at least 'till MSc so I'd prefer a country with a modern school system (well, pretty much any school system is modern relative to the Hungarian, so whatever...). I've fucked up my last semesters so I don't have the grades necessary for a scholarship, therefore a part-time job would be necessary.\n\nFor simplicity reasons (and since I'm an atheist), an EU country would be preferred, though I'm not completely against the idea of going to a country outside the continent. I can tolerate pretty much any climate. I'm currently thinking about London, Dublin, Berlin, München, Vienna, Salzburg, Stockholm, Helsinki, Amsterdam, Madrid and Barcelona though I'm open to suggestions.\n\n**Tl;dr** Hungarian CS&E student with a BSc needs a country where he could get a part-time job, some kind of residence and an MSc education. Where?", "author": "gerusz", "created_utc": 1293485015.0, "score": 1, "url": "https://www.reddit.com/r/IWantOut/comments/es7we/getting_my_bsc_in_cse_in_a_semester_or_an_year/", "num_comments": 1, "subreddit": "IWantOut", "id": "es7we", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "How can I find a part-time job in Berlin as an international student with no German?", "selftext": "I recently moved to Berlin to start my Master’s studies and I’m currently looking for a part-time job to support myself. The challenge is that I don’t speak much German yet (only some basic phrases), so I’m wondering what kind of jobs are realistic for someone in my situation.\n\nDoes anyone have tips on where I can apply? Or any places that are more open to English-speaking students (restaurants, delivery, warehouses, etc.)? If you know someone hiring or have any advice, I’d really appreciate the help!\n\nThanks a lot in advance 🙏", "author": "sina_778", "created_utc": 1748380084.0, "score": 0, "url": "https://www.reddit.com/r/askberliners/comments/1kwywhk/how_can_i_find_a_parttime_job_in_berlin_as_an/", "num_comments": 10, "subreddit": "askberliners", "id": "1kwywhk", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Finding a student job with English", "selftext": "Hello Everyone,\n\nI recently moved to Berlin to continue my studies and am currently facing challenges in finding a part-time job to support myself financially.\n\nI have strong experience in project and event management, as well as hospitality, having worked in Myanmar for four years and Dubai for three years also. However, my biggest challenge is that I don’t speak German, I’m fluent in English only.\n\nIf anyone has advice or knows of any opportunities where English is sufficient, I would really appreciate your help.\n\nThanks in advance!", "author": "kaunghtetjack", "created_utc": 1739567247.0, "score": 0, "url": "https://www.reddit.com/r/askberliners/comments/1ipl0rt/finding_a_student_job_with_english/", "num_comments": 12, "subreddit": "askberliners", "id": "1ipl0rt", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Moving to berlin with my family", "selftext": "My partner and I and our 2 cats and dog are moving to Berlin and will have around 60k-70k saved up and probably after the move and beginning expenses i will have 40k-50k. I have been working hard to save for this. Do you think this will be enough to be a student for the first year and then start to look for a job. i want to become fluent before i look for a job and fully integrate into the culture. I know we can get part time jobs and that will be the goal immediately but i have also heard that can be tough so i just want to cover my bases. thanks for your kindness 🤍", "author": "Secret-Impact9247", "created_utc": 1739493086.0, "score": 4, "url": "https://www.reddit.com/r/askberliners/comments/1ioy2ms/moving_to_berlin_with_my_family/", "num_comments": 25, "subreddit": "askberliners", "id": "1ioy2ms", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Help me get a part time job in Berlin", "selftext": "Hi guys I am a bachelor student in Berlin. I came around 3 months ago and struggling to get a part time job in English. Can anyone help me please 🥺\n\nUmm... I know python, SQL, C, HTML5 and some basic CSS. I have a bit knowledge in physics, some knowledge in General relativity theory and quantum physics. Good maths, linear algebra, vectors, calculus etc.\nAnd as per soft skills or like life skills ... I don't have any certification or something but I can do anything... Cooking or catering like odd jobs.\nGerman A2 and English C1", "author": "Sufficient-Counter52", "created_utc": 1738314762.0, "score": 0, "url": "https://www.reddit.com/r/askberliners/comments/1ieavon/help_me_get_a_part_time_job_in_berlin/", "num_comments": 17, "subreddit": "askberliners", "id": "1ieavon", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Job seeking visa appointment takes forever", "selftext": "Hi Berliners, I just graduated with my master’s degree from HU and I have used the contact form to inquire a Termin to extend my visa. The current visa will terminate by the end of this month and I’ve been sending them questions and documents needed to get the 18-month visa extension. However, it has been 2 weeks since my first request (first request was October 1) and I’ve not heard anything from them yet. I sent another one last week (October 7) and I still have received nothing. So my questions are:\n\n1. Does anyone know how long the wait for the appointment is?\n\n2. In the confirmation page (as seen in picture) they say I can continue to work and study until I receive an appointment. Since my current visa is for student and allows for 120 full days or 240 half days work, does that mean I can still apply and work part-time jobs and the current working permit is valid until I get a Termin?", "author": "turtleresa", "created_utc": 1729065516.0, "score": 0, "url": "https://i.redd.it/51nwjo4ir2vd1.jpeg", "num_comments": 3, "subreddit": "askberliners", "id": "1g4u59j", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
{"title": "Which German City Is Best for Student Jobs and Career Opportunities After Graduation?", "selftext": "**Which city is better for finding a part-time job during my studies, and a full-time job after graduation?**  \nI applied for a master's degree in Germany and have been accepted into the following programs:\n\n* **Heritage Conservation and World Heritage Studies** at **BTU Cottbus**,\n* **Linguistics** in **Cologne**. I'm also waiting for the result of the **ISME program** at **Freie Universität Berlin**.\n\nWhich one should I choose? I don’t speak German yet, but I’m planning to learn it to improve my job opportunities.", "author": "Spiritual-Ad5548", "created_utc": 1749060057.0, "score": 0, "url": "https://www.reddit.com/r/Germany_Jobs/comments/1l3cf93/which_german_city_is_best_for_student_jobs_and/", "num_comments": 9, "subreddit": "Germany_Jobs", "id": "1l3cf93", "search_context": "\"job hunting\" OR \"finding a job\" OR \"student job\" OR \"part time job\" AND student AND Berlin"}
